var tim = document.getElementsByClassName("tim")
var h1 = document.getElementsByClassName("h1")
var inp = document.getElementsByTagName("input")
var xax = document.getElementsByClassName("dasht")
var s = document.getElementById(1)
var tim1
var tim2
var tim3
var tim4
var hashiv
var jamanak
var sxm = 0
var han = 0
var han1 = 0
var han2 = 0
var han3 = 0
var han4 = 0
var han5 = 0
var han6 = 0
var miavor = 0
var miavor2 = 0
var miavor3 = 0
var miavor4 = 0
var myuner = 0
var cl = 0
var verjms = 0
var verjamas2 = 0
var verjms3 = 0
var mysuss = 0
var mysuss1 = 0
var mysuss2 = 0
var mysuss3 = 0
var myusner = 0
var miyavorner = 0
var miyavorner2 = 0
var miyavorner3 = 0
var miyavorner4 = 0
var verjmas1 = 0
var verjmas2 = 0
var verjmas3 = 0
var rejim
var qanak = 6
var xax
var im
var exav = 0


var barers = [
    "կարոտ", "ամպ", "լուսին", "խորոված", "մաֆիա", "պզուկ", "բացիչ", "էկրան", "սիլոտկա", "խալի", "սփրտել"
    , "սկավառակ", "հարփել", "հրաշք", "հուր", "հրուշակեղեն", "բոլոլա", "ստեղնաշար", "մկնիկ", "պահել", "թաքուն"
    , "անկախ", "առույգ", "առյուծ", "դելֆին", "պլանկտոն", "ցունամի", "ցմփոր", "հաց", "պանիր", "կարգ", "կարկուտ"
    , "լեռ", "գիշեր", "արծիվ", "միանալ", "պատմություն", "զորավոր", "էջ", "դանակ", "մկրատ", "սրել", "հաելի", "դիմակ"
    , "ձեռնոց", "կարանտին", "դրություն", "դաս", "դպորց", "ուսուցիչ", "տնօրեն", "նստատեղ", "աթոռ", "նոր տարի"
    , "բժիշկ", "հաքեր", "փայտ", "կուսակցություն", "եմիգռանդ", "ահաբեկիչ", "առվակ", "ջրամբար", "կլիմա"
    , "բուֆետ", "Ամազոն", "դոշակ", "տառ", "բառ", "նախադասություն", "մուլտֆիլմ", "սցենար", "սարսափ", "ռեժիսոր"
    , "տանկիստ", "հրացան", "Դիլիջան", "պարուհի", "մասիկ", "դաշնակահար", "ձավար", "դամբուլ", "երեխա"
    , "չար", "մութ", "լուսատու", "գրավիտացիա", "օրենք", "սահման", "սահմանադրություն", "դեմ", "կապուչինո", "նավթ"
    , "բենզին", "պայուսակ", "գազար", "կարտոֆիլ", "կրուասան", "էկլեռ", "կոկա կոլա", "կոկաին", "նիկոտին"
    , "թույն", "մարդասպան", "տեսախցիկ", "Լուվր", "ռեժիմ", "պատիժ", "գորտ", "օձ", "սարդ", "ֆոբիա", "արախնոֆոբիա"
    , "հոքեկան", "բան", "խուճուճ", "շնչափող", "երազ", "իղձ", "մաթեմատիկա", "արմատ", "մակերես", "թարգմանիչ"
    , "Ամերիկա", "Կորեա", "Ջորջ Վաշինկտոն", "Փարիզ", "աշտարակ", "լոր", "լեռնաշղթա", "արդյունավետ"
    , "Մաուգլի", "Մադագասկար", "կետ", "շնաձուկ", "աստեռոիդ", "աստղ", "Գուգլ", "յուտուբ", "ինստագրամ"
    , "դոնոր", "փարոս", "նպաստել", "հետ", "առաջ", "օրագիր", "լսարան", "վանտակ", "իրիկնահաց", "Տապասիա"
    , "ղումարբազ", "գռազ", "ընձուղտ", "բոլոկի", "ազատ", "առողջ", "առճիճ", "անագ", "երկար", "քիմիա"
    , "կրաքար", "երանի", "փրայմ", "ոհմակ", "շնագայլ", "արջ", "անձնագիր", "ծալք", "ատեստատ", "ծալապակաս"
    , "ալիք", "փաստ", "կյանք", "կես", "տերև", "ճահիճ", "Հրազդան", "աբսենտեիզմ", "ագուցանել", "ազատամիտ", "ազատասեր", "հավաբուն"
    , "արտագրել", "Լենին", "անազնիվ", "փայլ","ցնորք","ալեբախել","ալեծփանք","ալեծփել","ալեկոծել","ալեկոծություն"
    ,"ալեկոծում","ալեվետել","ալֆոնս",   "ախորժ",  "ախորժաբար", "ականջ", "ականջդրել",  "ակնակիր",  "ակնավաճառ","ակնավաճառություն",
    "ահագին","ահեղ","օդյակ","անալի","աղի","աղավաղել","Բիլ Գեյլս","աղեղ","անշուք","աղվես","աճյուն",
    "ամ","ամալ","ամանակավոր","ամարայնի","ամբառնալ","ամբաստանություն","ամբաստանք","ամբարհավաճ","ամբարհավաճել","ամբարհավաճություն",
    "Լիլի Հովեր","Կոմիտաս","Մայրամուտ","սագ","սուլել","բոց","խելագար","խենթ",
    "ամերիկյան","ամենքը","այբուբեն","այցելել","անապատ","անասուն","անխնա","խնամք","անհող","անշուշտ","առարկայական","ասանկ","ոսկեզոծ",
    "ական","արկեր","արհեստական","արձակագիր","արքայաժառանգ","շանթարգել","արքունիք","հաջողակ","երջանիկ","նաշադիր",
    "արձան","բազմազան","ժանիք","ատամհատիկ","խորհուրդ","խորհրդավոր","բակ","թանկարժեք","բախտավոր","բանաստեղծ","բանսարկու",
    "տեսական","բարբառ","քող","խմոր","պայտ","գնդացիր","բռնազբոսիկ","գազանակեր","թուք","թրատամ","ժայռ","կերպարանք","անուղեղ",
    "գինետուն","գոռոզ","գոռոզանալ","գոռոզություն","գովական","գովանի","գովելի","գորով","գութ","գույներ չխնայել","գուրգուրանք","դադարանք","դալտոնիզմ","դաժանագին",
    "նազ","դիմապակի","դառը","մելամաղձոտ","սրբապատկեր","զրո","լուսատիտիկ","հարկային","դասղեկ","դեպք","դեպի","դեռևս","դժնակ","սլացիկ",
    "կազմվածք","դյուրին","դպիր","դրախտ","սողուն","ազդակ","պարկ","դրամապաշտ","սալ","կանդալ","սպանություն","անկիրթ","տորֆ"
    ,"եղծանել","եղծավոր","եղծել","երազկոտ","երախճան","երիտասարդություն","երկայնակի","երկայնավիզ","երկնագույն","երկերեսանի","երեկոյան","զառանցանք","զգայարան","զղջալ",
    "սրածայր","զորացյալ","զրպարտություն","ընդդիմանալ","ընդմիշտ","ընդունարան","ընջուղ","ընտանի","թագաժառանգ","զորեղ","թափառական","դիպչել","թիկնազոր","թիակ",
    "թուզ","ժամկետ","լեռնակողմ","թերթիկ","լարում","խավար","խիղճ","գեր", "գիր", "գրել", "երգ",
   "երգել","ընթերցել","թիվ", "ուսանել","անկողին" , "արդ", "վերարկու", "բոկ" , "գինդ", "զարդ", "զգեստ", "հագնել" , "կիսամերկ", "օթոց", "օծել","ալյուր" ,  "աղանձ", "արբ" , "բոկեղ", 
   "դալ", "դոն" , "թան", "կաթ", "կեր", "կերակուր", "կորկոտ", "կուտ", "մածուն", "մեղր", "չիր", "ջուր", "ուտել","աղորիք" ,"աղալ", "աճյուն" , "աման", "այրել", "այնկողմ" , "ավել", "այծ",
   "բովել", "բորբոքել","բոց", "բուլ", "բուրդ", "գդալ" ,"գեղմ","եռալ","եփել","զեղել","թաթավել","լոգանալ", "լսել", "լվանալ", "խայծ", "կծել", "քայլ", "խաշել" , "թափթփուկ" , "խորովել", 
   "կայծ", "հալել", "նորովի","հազվադեպ", "հում", "մուխ","մրոտ" ,"փրկել","մուր", "առաքիչ", "նքույր" , "շաղել", "շաղաղել", "պղպջակ", "ջեռուցել", "ծեծել" , "քամել","կշտանալ", 
   "լղարել", "աղավաղել", "աղկաղկ", "աղտ", "աղքատ", "այլ","այց", "անձուկ", "անուն",
   "անուրջ", "առնել", "ատել", "ասել", "արգահատել", "արգել", "արդար", "արթուն", "արի", 
   "արծարծել", "զարմանալ", "բամբասել", "բան", "բառ", " բառնալ", " բարձր", " բեկել", " բեռ",
    "բերել", "բարձրաբերձ", "բլբլալ", "բոլոր", "կլոր", "գոռալ", " բութ", "գալ", " գալարել", "գաղտ",
     "գաղել", "գաղջ", "զզվել", "գարշ", "գեղեցիկ", "գեջ", "գերփել", "գիտենալ", " գլել", " գլորել", " գող",
      "գոյ", "գործել", "գռփել", "գտնել", "դադարել", "դամբան", "դամբարան", "դառնալ", "դեդևել", "դի",
       "դիակ", "դնել", "ծեծել", "դուզ", "եզր", "ելնել", "ելուզակ", "եկ", "լինել", "եղուկ", "երգիծել",  
       "երես", "երերալ", "երթալ", " երկնչել", "երևալ", "զայրանալ", "զանգիտել", "զարկ", "զգալ", "զեղել", 
       "զերծ", "զմրել", "ընթանալ", "ընծա", "ընկղմել", "ընկնել", "ընտիր", " թաթավել", "թակել", " թանձր",
        "թառամ", "թարմ", "թարշամ", "թավ", "թեր", "թերի", "թմրել", "թոնթորալ", "թոպել", "թնդալ", "հեկեկ",
        "թռչել", "իր", " իրավ", "լաց", "լավ", "լերկ", "լի", "լիզել", "լիրբ", "լլկել", "լկստած", "լողալ", "լպիրշ", 
        "լսել", "լցնել", "լուծել", " լուռ", "լքել", "խածել", "կծել", "խայտ", "խանդ", "խաշ", "ծաղր", " ծամել", 
        "ծեծել", "ծեր", "ծիծաղ", "մաստակ", "ծպտուն", "ծուլ", "որջ", "կլանել", "կլոր", "կմշել", "կմշտոց", "խուճապ", 
        "կողմ", " կորիզ", "կրծել", "ամուր", "հագենալ", "հայցել", "հանգ", "հառնել", "հասնել", "հաստ", "հաստատ", 
        "հավելել", "հարել", "հարթել", "հարկ", "հարմար", "հարցնել", "հեծնել", "հեղգ", "հեղեղ", "հեռ", "հերթ", "հին", 
        "հոգ", "հոլանի", "հոլովել", "հոտ", "հոտոտել", "սեղմ", "ձաղել", "ձիր", "անվճար", "ճանաչել", "ճառագել", "մանր", 
        "մաշել", "մաստ", "մատղաշ", "մարել", "բորբոսնել", "մեծ", "մեղմ", "մեռնել", "մլալ", " ծխալ", "մնալ", "հորինել", 
        "մոլար", "մոլի", "մոլոր", "մոռանալ", "մույն", " մունջ", "ներքև", "նստել", "նոր", "նսեմ", "նուրբ", "յուղաներկ", "ողբալ", "ողողել", 
        "ողորկ", "ողորմել","ողոքել", "ողջ", "չոր", "պապանձվել", "պինդ", "պլոկել", "ջանալ", "ջերմ", "ջին", "ջինջ", "ջնել", "ջնջել", 
        "սաստ", "սաստիկ", "սեգ", "սեռ", "սերել", "սերունդ", "մերսեդես", "սիրել", "սխալ", "ընկղմվել", "սնել", "սպառնալ", "ստանալ", "ստեպ",
         "ստիպել", "ստույգ", "սուտ", "սուր", "սուրբ", "տամուկ", "տատանել", "տարտամ", "ցիրուցան", "տեսնել", "տնտղել", "տնքալ", "տոկալ",
          "տևել", "ցայտել", "ցիտել", "ցրել", "ցուցանել", "ուծանալ", "ունայն", "ուտել", "ուրանալփայլ", "փայլել", "վատ", "փեռեկել", "փերթ", 
          "փողփողել", "փորձել", "փոքր", "փչել", "փռալ", "փռթկալ", "ծածանվել", "վրիպել", "փրփուր", "փութալ", "փուստ", "փուք", "քաղց", 
          "քենքորել", "քուն", "օգնել", "օգուտ","երաշտ",'մահակ',"վտակ","բազե", "կաչաղակ", "կապիկ", "մորեխ", "մողես", "հովազ", "սամույր", "սիրամարգ", 
          "վագր", "վիշապ", "տատրակ","փիղ","ազոխ", "անանուխ", "արմավ", "բրինձ", "գազար", "դարիճենիկ", "դժնիկ", "զվիրակ",
          "թութակ", "կաղամբ", "գումար", "կանկար", "կապար", "կարոս","կնճիթ", "համասպրամ", "հասմիկ", "մանուշակ", "մորուտ", "նարգիս", "նոճի","շահասպրամ", 
          "շահդանակ","շաղգամ", "չաման", "պիստակ", "պղպեղ", "սոխ", "սոնիճ", "սպանդ", "վարդ", "վարունգ",
          "անուշադր", "ապակի", "արճիճ", "արույր", "բորակ", "գոհար", "քար", "զմրուխտ", "ժանգ", "ջրածին","լեղակ",
          "խունկ", "կնդրուկ", "ալմազ", "պղինձ","պողպատ", "սնգույր", "վեմ", "քափուր","բազուկ", "գես", "դաստակ", "դեմք", "երակ", "երանք", "կուլակ", "կուշտ",
          "ճակատ","վարս","էներգիա", "բույժ", "բորոտ", "դաշտան", "դարման", "ժահր", "կույր", "մահ","ազգ", "ամբոխ", "ասպնջական", "գրոհ", "դայակ", "երիտասարդ", "հարազատ",
          "հարևան", "նժդեհ", "տոմատ", "պապ", "թոռ", "ռամիկ", "տաշել", "տոհմ", "օտար","աշակերտ", "գուսան", "դաստիարակ", "դպիր", "տոկոս", "զանգակ",
           "թմբուկ", "խրատ", "ճատրակ", "հանճար", "մատյան", "նկար", "նվագ", "պատկեր", "հրահանգ", "վարդապետ", "վարժել", "վին", "գավառ", "քանդակել",
         "ապաշխարել", "բախտ", "բագին", "գուշակ", "Եփրատ", "դև", "դժոխք", "զոհ", "կախարդ", "հմայիլ", "հրաշք", "հրեշտակ", "մարգարե", "մեհյան", "նզովք", "նվեր", 
         "պաշտել", "պարիկ","դժոխք", "վանք", "տաճար", "օրհնել","ասպանդակ", "բադ", "բաշ", "գավազան", "գոմեշ", "դանդաղ", "հոգս", "խամրել", "խարազանել", "ճամբարակ", "ճանկ", "ճաշակել",
         "մաճ","մատաղ", "մարգ", "նոխազ", "պահեզ", "պատվաստ", "պարտեզ", "սմբակ", "վարել", "փեթակ",
         "ախոռ", "սահուն", "ամբարտակ", "ապարանք", "ավազան", "արժել", "բանտ", "բարոյական", "գանձ", "գանձապահ", "գմբեթ", "գրավ", "դահլիճ", "դամ", "կիրթ", "դարպաս", "դերձակ", "դերձան",
          "դիվան", "երաշխ", "զնդան", "թանկ", "համարել", "ճախարակ", "ճեմիշ", "նավազ", "պահապան", "պատշգամբ", "պատվար", "պարիսպ", "պարտք", "սրահ", "վաճառել", "առու", "վարձ", "վճարել", "վնաս",
           "տաշել", "տուգանք", "տույժ", "փեղք","աբրեշում", "անդրավարտիք", "ապարանջան", "անզգույշ", "բամբակ", "գրպան", "հեռադիտակ", "կառապան", "թագ","խուզարկու", "գոտի", "կերպար", "կոշիկ",
            "հանդերձ", "մույկ", "մուճակ", "մուշտակ", "շապիկ", "պաստառ", "պատմուճան", "կավիճ", "պսակ", "սանդալ", "սնդուս", "վարտիք", "վերմակ","ապուխտ", "խորտիկ", "կարագ", "հրուշակ", "ճաշ", "ճարպ",
             "նշխար", "շաքար", "պանիր", "օշարակ",
            "առասան", "բաժակ", "բարձունք", "բղուկ","գահ", "դաստառակ", "դարան", "դույլ", "զամբյուղ", "թակույկ", "լական", "կարավան", "կուժ", "հավանգ", "ճանապարհ", "ճրագ", "մակույկ", "մոմ", "շիշ", "պայուսակ", "պատրույգ",
             "սպաս", "սրվակ", "վանդակ", "տախտ", "տախտակ", "բեմոլ", "տաշտ", "տաշտակ", "տապակ", "քսակ", "քուրձ","բյուր", "գրիվ", "դահեկան", "դրամ", "ժամ", "ժամանակ", "հազար", "նախ", "նահանջ", "նավասարդ", "փող",
             "աշխարհ", "անապատ", "ապահարզան", "ապստամբ", "ասպատակ", "ասպետ", "արշավ", "ավար", "ավան", "բարապան", "բդեշխ", "գումարտակ","գունդ", "դահիճ", "դաշն", "դաշտ", "դարան", "դատ", "դատաստան", "դատավոր",
              "դեսպան", "դրոշ", "զենք", "զինվոր", "զորք", "զրահ", "թշնամի", "իշխան", "իշխել", "համհարզ", "հաշտություն", "հեն", "հպատակ", "հրամանատար", "հրապարակ", "հրովարտակ", "ճամբար", "մարզ", "մարզել", "մարզպան", "մուրհակ", 
              "նախարար", "նախաճաշ", "նահանջ", "նահապետ", "նամակ", "նիզակ", "նվիրակ", "շահամոլ", "շենք", "այգի", "ոստիկան", "պահակ", "պայքար", "պատերազմ", "պատճեն", "պատվիրակ", "ցուրտ", "պետ", "աշխատավարձ", "սահման", "սաղավարտ",
               "սեպուհ", "սպարապետ", "վահան", "վկա", "վճիռ", "տապար","օրենք",
               "գույն", "երանգ", "կապույտ", "կարմիր", "ճերմակ", "սև", "սպիտակ",
               "ախորժ", "ակամա", "անգամ", "կամա", "ազդ", "ամբարիշտ", "ամբարտավան", "անապակ", "անուշ", "աշկարա", "աշխատել", "ապաստան", "ապիրատ", "ապսպրել", "առատ", "առույգ", "արագ", "արժան", "արձակ", "ավարտ", "ավեր", "բազում", "բազմել", "բաժանել", "բաշխել", "բարակ", "բավ", "բնակվել", "բովանդակություն", "բույր", "գովել", "գումարել", "դաժան", "դեմ", "դիտել", "դժգույն", "դժգոհ", "կամար", "դժնդակ", "պահապան", "դժվար", "դսրովել", "վատառողջ", "դրժել", "օրիորդ", "երամ", "երկ", "զանազան", "զորություն", "զուր", "զգույշ", "թշնամանք", "թշվառ", "թոշակ", "ժահ", "ժանր", "երեսանի", "սանձ", "խոստանալ", "խոստովանել", "խորտակել", "կամք", "ձև", "կերպ", "կույտ", "հակիրճ", "բարեհաճել", "համ", "չարչարանք", "համայն", "հանգամանք", "հանդարտ", "ընթրիք", "հանդիման", "հավասար", "հավետ", "հավերժ", "հզոր", "հիշատակ", "հիշել", "ճար", "հրամայել", "հրաման", "հրավեր", "հուզել", "հույժ", "ճախր", "ճակատ", "սուրանդակ","ճարպիկ", "ճեմել", "միշտ", "մուրազ", "նազել", "նամ", "զանազան", "նիշ", "նիրհել", "ճկուն", "նման", "նշան", "Նշտարիկ", "նշմարել", "նպաստ", "շատ", "շնորհ", "շտապ", "թուխ", "պահել", "պայման", "պաշտպան", "պատասխան", "պատգամ", "պատվիրել", "պատիվ", "պատշաճ", "գորգ", "պատվիրան", "պատսպարել", "պատրաստ", "պատուհաս", "պարարտ", "պարզ", "տեսակ", "պետք", "ջատագով", "հրաման", "զվարճանալ", "սով", "սպանել", "ստվարաթուղտ", "ներարկել", "սուգ", "վազել", "վանկ", "վատ", "վատություն", "վավերական", "վեհ", "վիճակ", "վիշտ", "վճիտ", "վստահ", "վտարել",
               "վրեպ", "տակ", "տակավին", "տանջել", "տարազ", "տոթ", "ուխտ", "ուժ", "ուշ", "փարթամ", "փառք", "փտել", "քանդել", "օրինակ","առաջնորդ","լիդեր"
               ,"վեպ","նովել","Հովհանես Թումանյան","Արամե","Գրիշա Աղախանյան","ֆլամինգո","պաղպաղակ","Արցախ","ճակատամարտ","պատ"
               ,"պարսիկ","զորհված","Հոգվարտս","սենյակ","գլաձիատոր","շշուկ","Դամբլդոր","Ջեյմս Քերրին","Ջոնի Դեպ","Օբսիդիան","արծաթ","նիհար"
               ,"ստրուկ","Եգիպտոս","Հերկուլես","Մերլին","Մերիլին Մոնրո","Ջոն Քենեդի","սկաֆանդր","տիեզերք","աստղ","աստղաթափ","աուրա"
               ,"անսանձ","Բուցեֆալ","սիտքոմ","Եղիշե","Ալեքսանդր Թամանյան","կարմրաթուշ","Անտակտիդա","Էկսորցիզմ","Դռակուլա","Ատլանտիդա"
               ,"Ալկատրաս","Շեռլոկ Հոմս","Մոնթե Մելքոնյան","Սողոմոն Թեհլերյան","Էմբլեմա","աղետ","Տեսլա","կայք","մոնտաժ","առվույտ"
               ,"բրոնզ","կավ","կտավ","վրձին","ջրաներկ","զոդել","դեֆորմացիա","խոշորացույց","դիրքեր","նռնակ","գիրք","գրիչ"
               ,"անգլերեն","Բել","Գուրգեն Մահարի","փշալար","հավելված","կոդ","կրեմ","դասնվալ","դիմագիծ","ավոկադո","Զիգմունդ Ֆռեյդ"
               ,"սիգար","երկ","ասմունք","մոմ","ինքնահող","սիրտ","սրտացավ","մարջան","ապարանջան","Շահ Աբաս","Տիգրան Մեծ","Հիպոկրատ"
               ,"երդում","հանցանք","թաշկինակ","կնքահայր","ԴիՋեյ","վանիլ","տորթ","մխոց","ռեկորդ","շարժիչ","պիռանիա","պիթոն","Տառանտուլ"
               ,"չարաճճի","զարդ","ոսկի","թրծել","թորել","զտել","Արքայաջուր","Դիոգենես","տակառ","հանգույց","արագաչափ"
               ,"ուղղաձիգ","ուղղագիծ","շրջանագիծ","շրջան","մակարդակ","խոցված","ոճաբան","որակ","անարդար","բրդոդ","Վարդանանք"
               ,"Արմաղան","Սասնա Ծռեր","սափրվել","շրթներկ","վաճառողուհի","բարտեր","ՀԾՀ","ԱԱԾ","այբուբեն","ծով","Ախթամար","լաստ"
               ,"կոկորդիլոս","վարան","ճպուռ","մրջյուն","իշամեղու","մանդարին","ամենակեր","ալիք","գեղասահք","խաչմերուկ","իրավունք"
               ,"անիրավ","վսեմ","մահճակալ","մռնչալ","մլավել","մուկ","կատու","քուրմ","քրմապետ","հազարապետ","սպարապետ","օժիտ"
               ,"բրինձ","Դագեստան","չեչեն","ջրարջ","ծովախոզուկ","նապաստակ","գայլ","մարդագայլ","կիսալուսին","ձիավոր"
               ,"ձի","ձուկ","շերեփ","շերեփուկ","կիսաստղ","թերակղզի","ափամերձ","այլայլվել","մոլագար","խանութ","խնձոր","տխուր"
               ,"սերիական","խուզարկու","քննիչ","դետեկտիվ","վարգր","վարազ","Մեռյալ","հովիտ","կատար","գլուխ","ուղեղ","կիսագունդ"
               ,"շառավիղ","տրամագիծ","ֆառենհայտ","կիլոգրամ","մետր","կելվին","թեյ","ափսե","սերվեր","կրիչ","գոտկատեղ"
               ,"դրամա","լեզու","ասեղ","ներարկիչ","թերապեֆտ","թոք","սղոց","մոխրագույն","մուգ","մենյու","տեսահոլովակ"
               ,"խխունջ","խառը","բամբասել","երկիծանք","ֆոսֆոր","ճառագայթ","ծռվել","ծամածուռ","կարգավորում","էլեկտրոն"
               ,"միջուկ","դրական","բացասական","արյուն","լեկոպլաստ","լեյկոցիդ","վերջակետ","վերջ","ավարտ","սկիզբ"
               ,"տնակ","խրճիթ","ողբանվագ","լացակումաց","լար","սիրել","արնանման","խելագարված","դրոշմանիշ","դդում","լոլիկ"
               ,"Տիգրիս","Սևանա լիճ","սևակ","ունկնդիր","լող","լողավազան","պոմպ","Անխել","թրջվել","փետուր","ծաղիկ"
               ,"թերթ","Անակոնդա","վայրի","երգիչ","երազանք","երփներանգ","ապտակ","ճամբար","ճոճվել","ցանց","ցուլ"
               ,"ցլամարտիկ","մարտիկ","տնտեսագետ","հեռուստառեժիսոր","օպերատոր","կիբեռնետիկա","ակադեմիա","ֆիզիկա"
               ,"գրական","բառեր","հատկացուցիչ","եզակի","հոգնակի","ենթակա","ստորոգյալ","բայ","շաղկապ","ուղղական"
               ,"տրական","ներգոյական","ստորադասական","բարդ","գարեջուր","գինի","օղի","թուր","թուղթ","թափոն"
               ,"նորագույն","պալեոլիտ","նեգրոիդ","մոնղոլոիդ","մոնղոլ","ազատամարտիկ","Շառլ Ազնավուր","շունչ"
               ,"ազոտ","թթվածին","հիպնոզ","թիթիզ","գլամուռ","ֆոտոգենիկ","հեծանիվ","կախարդանք","մոխիր"
               ,"լալ","հաշմանդամ","ռեպ","ռոք","ջազ","դասական","աստղով","քույր","մայր","հայր","եղբայր"
               ,"գրավիչ","ընկերասեր","ընկեր","ընկերուհի","անգլուխ","գրագետ","զարգացած","պետություն"
               ,"դաշնություն","լեզգինկա","հանուն","աշխատասեր","թասիբ","թունաքիմիկատ","մարզիչ"
               ,"հոքեբան","հոքեմեդ","դեղ","բուլինգ","ենթարկվել","վարձ","վարորդ","լուսանկարիչ","լուսնոտ"
               ,"լրաբեր","լույս","տարանջատել","միացնել","թակել","փակել","դուռ","ծխնիներ","ավտոտնակ"
               ,"ավտոմատ","արագացում","արագություն","օպտիկա","շոգենավ","պարկապզուկ","ակորդեոն"
               ,"քանոն","գիթառ","չաթ","խաղամոլ","խեժ","ծուխ","ծխախոտ","քաշել","մատ","բռոկոլի"
               ,"ծաղկեփունջ","գրառում","որոգայթ","Բիլլի Այլիշ","ռուբին","բռլիանդ","դուստր","բջիջ","մոլեկուլ"
               ,"ատոմ","դատարկ","լրանալ","դոմեն","հոստ","Լասվեգաս","Լեոնել Մեսի","Կրիստիանո Ռոնալդո"
               ,"բռնցքամարտ","Իփ Ման","բարբի","բուռածինո","մալվինա","տիկնիկ","Անաբել","շերիֆ","հիպեր"
               ,"Բրյուս Լի","Տիգրան Ավդալյան","խալաթ","Մհեր Մկրտչյան","եռանկյուն","ուղղանկյուն"
               ,"Արամ Խաչատրյան","երիկամ","մազանոթ","աորտա","էլիպս","խորանարդ","քառակուսի"
               ,"գերադաս","ստորադաս","Հիպերբոլ","բալետ","բաչատա","վալս","տանգո","լատիներեն"
               ,"Վանուշ Խանամիրյան","հարթաշուրթ","հարթաթաթ","Ալեքսանդր Շիրվանզադե","սամբա","ռումբա","կադրիլ"
               ,"Չակոնա","ձող","տրիկո","շարֆ","մատյան","արտույտ","ագարակ","տոհմ","դերասան","անապատ"
               ,"Սահարա","Սոչի","վերագործարկել","քննություն","պարապել","փամփուշտ","պարկուճան"
               ,"պահեստատուփ","պիտույք","բանան","հարկ","հարկահավաք","թագավոր","ծարնր","սուրճ"
               ,"գանգատուփ","անցք","նեռվային","հաճախականություն","երթուղային","տրանսպորտ"
               ,"կանոն","օրենսգիրք","վերնաշապիկ","տաբատ","հագուստ","հարգ","Գարեգին Նժդեհ"
               ,"բեկոր","Մայքլ Ջեկսն","ռազետկա","հարաբերություն","ծարավել","ծանոթ"
               ,"ծանրակշիռ","ծանրամարտ","կալորիա","սպիտակուց","դեղնուց","հավկիթ","բազում"
               ,"բյուր","միտք","երկաթուղի","հանք","հանապազօրյա","ադամանդ","ալմազ"
               ,"սորբ","արքայատոհմ","կրոն","գահավիժել","կետադրություն","մշակել","շինպանզե"
               ,"գորիլա","շքախումբ","շքամուտք","շքանշան","զինանշան","գերբ","մատանի","ամուսնություն"
               ,"հարսանիք","կախազարդ","թևնոց","ականջող","առակ","գազետ","խաչբառ"
               ,"գարնանամուտ","նորություն","հաղորդագրություն","համադասարանցիներ","հյուր"
               ,"հյուրասենյակ","հյուրանոց","հյուրախաղեր","պլաստիկ","ռետին","սխեմա"
               ,"պարույր","բարձրախոս","հաղթանակ","պողոտա","խողովակ","բռնակ","գորգագործ"
               ,"խեցեգործ","խոհարար","ճկույտ","համակարգիչ","համակարգ","հակառակ","հականեխիչ"
               ,"լիմոն","լազուրիտ","պսպղալ","օդապարիկ","ինքնաթիռ","անոդաչու","անտարակույս"
               ,"ժուժկալ","շառժունակ","անկարող","անիծված","անհասցե","անմոռուկ","ժպտրերես"
               ,"բզեզ","գիպս","դրամահավաք","Դանիել Վարուժան","կոճակ","ժանյակ"
               ,"Ժաննա դ'Արկ","աբեղա","առեղծված","ապշել","այլմոլորակային","արհետ","առշավ"
               ,"առշավանք","խաչապաշտ","անբան","բուդիզմ","ստվեր","փլատակ","ավերել"
               ,"կամուրջ","երկնակամար","վարսավիր","ստեղն","ականջակալ","վոլտ","մանուշակ"
               ,"կարողություն","գանգստեր","ալկոգել","ելակ","ելուստ","ցողուն","տերև"
               ,"թմբկաթաղանթ","պարզունակ","պարսկահայ","արևելք","հարավ","հյուսիս"
               ,"արևմուտք","պատահար","կծիկ","հյուսել","նոտա","դիվանագետ","Նոտր Դամ"
               ,"լանջ","լեմուր","լամա","Լեհաստան","Ալպինիստ","դեղձ","դասալիք","անտեսանելի"
               ,"թխվածք","քաղցրավենիք","շաքարակլոր","գիտություն","քաղցկեղ","ջրծաղիկ"
               ,"թոքաբորբ","մկան","վարակ","վարակիչ","վարակված","դաժանաբար","դանակահարել"
               ,"երկտող","միատողանի","միանգամյա","անձեռոցիկ","քրտինք","դեժավիու","նոստալգիա"
               ,"բարեսիրտ","բարեկազմ","գրասեղան","գրադարան","գրադարանավար","սկուտեղ"
               ,"վառարան","վրեժ","բացարձակ","ջեռուցիչ","զարդուցիչ","զարթոնք","ֆերմա"
               ,"լարախաղ","սպորտսմեն","բանաձև","թեորեմ","մեկնաբանություն","հյութ","հրապարկախոս"
               ,"ժառգոն","զգացմունք","նպատակ","ձգտում","անկեղծ","սքատեցի","սրբավայր","շահ"
               ,"սառսուռ","լճակ","գետ","գիտուն","անգետ","փայտիկ","սոխակ","փայտփորիկ","չքնաղ"
               ,"անձ","անձնվիրաբար","ծառայել","ծափ","հասցե","վարչապետ","նախագահ","պատգամավոր"
               ,"թեկնածու","քաղաք","քաղաքականություն","կոռուպցիա","կալանք","կարդալ","նապակ"
               ,"մաքրասեր","ձերբակալել","վաճառք","հաճախորդ","գաղափար","ժամացույց","աղբահավաք"
               ,"ժրաջան","մեղու","սարդոստայն","փողկապ","մանկապարտեզ","քաոս","Ալեքսանդր Շիրվանզադե"
               ,"նոթբուկ","Մարկ Ցուկերբերգ","քաջ","որոնել","դար","գերդաստան","խաչագող","հիշատակարան"
               ,"ակնոց","կարգային","տաքսի","ուղևոր","սեփական","ընդունակ","ժամապահ","օրապահ"
               ,"գրքույկ","ավտոպահեստամաս","Մովսես Խորենացի","լրագրող","ծերունի","հիվանդ","շտապօգնություն"
               ,"կաթված","ինսուլտ","ինֆակտ","հաճախ","աշխատություն","սրբանկար","բացատրել","բացահայտել"
               ,"մազապուրծ","կարիճ","երկվորյակ","հորոսկոպ","Հռոմ","իգուանա","քամելեոն","կատվազգի","պումա"
               ,"մանդատ","վանդալիզմ","վրդոհված","վարձկան","սահադաշտ","սահորտ","Օլիմպիկ","ջրամբար","ջրահարս"
               ,"ջութակ","տուպերկուլոզ","խոզուկ","նժույգ","նարգիզ","բակտերիա","վիրուս","հակաչեզոքացուցիչ"
               ,"առևանգում","շեփոր","շրթունք","կորուստ","կզակ","ունք","բարբարոս","ցեղ","ֆիլմադարան"
               ,"Մոլդովիա","կարկանգակ","մրջնաբուն","պիկնիկ","վառվել","կրակմարիչ","կրակայրիչ","կայծքար"
               ,"դղյակ","հեքիաթ","բանիմաց","գազար","սմբուկ","ահազանգել","ոստիկան","դաշտավայր","համբույր"
               ,"հարյուր","միլիոն","աստղազարդ","ամպամած","վիրտուալ","փաստաթխթեր"
               ,"երաժշտություն","վահանակ","հսկիչ","սարք","ենթադրյալ","աջակցել","ակումբ",
               ,"տարազ","խնդուկ","գունակուրություն","ցլաշուն","քարշակ","ադեկվատ","ադմինիստրացիա","ալիմենտ","ախրանա","ակտիվ","ակտուալ","զեղջ","անոմալ","անոնս","արխիվ","գիդ","գրեչկա","դեպրեսիա"
               ,"մոդեմ","դեմոկռատ","Մոհամեդ Ալի","չիպս","ձողիկ","ձկնկուլ","հորաքույր","առավոտ","հասարակած"
               ,"բևբեռ","միջագետք","անդրկովկաս","ժողովուրդ","ժրաջան","մրջնակեր","սնունդ","գոյություն","գրոհել"
               ,"գրավել","գուլպա","ձյուն","ձնհալ","սունկ","շամպինիոն","Տոիկո","բեռնատար","բազմակետ","շոկոլադ"
               ,"Արթուր Ալեքսանյան","սխրանք","անձնազոհ","քաջալերել","ջանք","եռանդ","օպեռա","քաոս"
               ,"կալանք","կուալա","տեսանյութ","ձայնագրել","ձայն","զվարճանալ","պոնչիկ","կտրատել","համատեղում"
               ,"հրացանակիր","մազոխիստ","կրծքավանդակ","հրեղեն","ապահովիչ","մռութ","Ավստրալիա","հոռոսկոպ"
               ,"անոմալ","երևույթ","տարորինակ","կերակրուր","գալար","ժլատ","դրամապանակ","պահեստ","հնարամիտ"
               ,"գուշակել","մեղեդի","ապելսին","մոնո","ներկայացում","հատիկ","բարեկամ","ծիծաղ","ծակոտի"
               ,"կարմրել","աշխատաանք","թվական","եղեռն","եղևնի","մայրաքաղաք","մարզիք","մարտարվեստ"
               ,"լվացք","լուծկի","հրշեջ","նեխել","մանրե","թան","թանձր","թթու","լավաշ","խաչապուրի"
               ,"փախլավա","ղափամա","աղոթք","բալենի","բոթ","դախ","միմոս","գոտի","ամսաթիվ","համացանց"
               ,"նեյրոն","մասնիկ","մատուռ","լոբի","գետնախնձոր","արքայախնձոր","գետնանուշ","գնդակ","ֆուլտբոլ"
               ,"բասկետբոլ","բոուլինգ","մազ","շախմատ","շաշկի","շլդիկ","գլխավոր","Էվերեստ","Կլիմանջարո"
               ,"հրաբուխ","մագմա","լավա","խառնարան","ապոկալիպսիս","հրեա","հույն","երկրագունդ","երեսառած"
               ,"ցավ","ցնծալ","ցատկոտել","պինգվին","կաթնասուն","երկկենցաղ","մաշկ","գլխացավ","ցավազրկող"
               ,"թալան","թասակ","թուրմ","թմբկաբերդ","մատնիչ","սևաչյա","առավել","բարձր","ազնիվ","տղամարդ"
               ,"կնոջ","մատնությամբ","ամրոց","գնել","խապեբա","դահիճ","շահ","քարքարոտ","հայրենիք"
               ,"հոգսեր","հույս","պարոն","թափառական","աշուղ","տիկնայք","տղա","ամենք","ծննդյան"
               ,"փուչ","անց","անցավոր","խնդուն","գեղեցկություն","մարդ","գործ","անմահ","դարեդար"
               ,"անվերջ","անդադար","անեծք","որդի","լավություն","հավաքել","բերդ","անմահ","կարծել"
               ,"հսկա","անսասան","արյուձի","նժույգ","քառասուն","կռիվ","անթիվ","Հայաստան","արևահամ"
               ,"սազ","հեզաճկուն","նաիրյան","պար","երկինք","լիճ","ձմեռ","բուք","անհյուրնկալ","հնամյա"
               ,"հազարամյա","հաճենալ","հողանյութ","շինվածք","կենդանություն","անբառբառ","մանուկ"
               ,"ձեռք","պարզել","անզոր","ազատություն","խանգարել","արցունք","դարավոր","կրթաթոշակ"
               ,"հիպոտեկ","գազ","բրոխ","անալիզ","անգինա","անգին","առժեզուրկ","օքսիդանալ","նատրիում"
               ,"ածուխ","քարածուխ","զրահապատ","դաշույն","սամուրաի","ծածկադմփոց","ալգորիթմ"
               ,"որդեգիր","խորթ","կողմ","տեկիլա","կոկտեյլ","տաքարյուն","սառը","եփաց","վ"
               ,"հետո","ձեռնափայտ","ոսկերիչ","Կարդինալ","պայծառափայլ","արքա","դժողք"
               ,"հրատապ","ճանճ","Դեբեդ","Հրազդան","տառապանք","Սարդարապատ","ուխտ"
               ,"ուղտ","ձևական","ակունք","աղբյուր","նաֆթալին","թարս","շիտակ","խեցի"
               ,"խորը","ուժասպառ","կորուսյալ","կղզի","հենակետ","տաղ","աչքեր"
               ,"քաջասիրտ","ռազմի","«Սիրուն Սոնա»","խարիզխ","առագաստ","պարան"
               ,"հատկություն","կրիտիկական","հարս","փերի","ցրցամ","ցիրուցան","բանականություն"
               ,"օրթոպեդ","խոչնդոտ","ջրակայուն","ջրազուրկ","ջրասույզ","ջերմուկ","ազնվամորի"
               ,"մոշ","մալինա","կցորդ","չիպ","կոշտ","ծաղկաթումբ","ծաղկազարդ","ծաղկեփունջ"
               ,"եղինջ","եղիամ","ցլաշուն","ցլամարտ","վանել","ձգել","զսպանակ","գարշապար"
               ,"նախաբազուկ","պարանոց","աղիք","օրգան","օրգանիզմ","համակարգ","համախումբ"
               ,"մարգագետին","եժանագին","ավազ","ցեմենտ","թրթուր","որդ","թիթեռ","թևեր"
               ,"գործազուրկ","ծաղկաման","բուսականություն","կենսոլորտ","մթնոլորտ","ջրոլորտ"
               ,"քարոլորտ","ցորեն","որդան կարմիր","ոխկույզ","ոզնի","որս","որսորդ","Վլադիկավկազ"
               ,"մարզպետ","Գալիա","կայսր","խլահավ","հանելուկ","արկածային","արկած","ատոմակայան"
               ,"ոտք","վերնագիր","փողկապ","ժավել","սպիրտ","մաղ","քամիչ","զտիչ","պատվեր","բառբառ"
               ,"Գյումրի","Ալեքսանդրապոլ","Թրամպ","կնիք","արցակ","չապածո","տող","լուսանցք"
               ,"թեմա","թեմատիկ","գրավոր","ասմունքել","արտասանություն","ալեհավաք","ալեհեր"
               ,"անուն","ազգանուն","հայրանուն","մորուք","սպի","շող","Սերգեյ Դանիելյան","շտեմարան"
               ,"լեկցիա","մաքրագրել","սևագիր","դրոն","թռիչք","կաթսա","կափարիչ","դեր"
               ,"դերակատար","բատման","հերոս","մերսի","շահում","շանս","քացախ","հետազոտվել"
               ,"ստել","իրավաբան","պոկեռ","ակացիա","ապերախտ","ալերգիա","իներցիա"
               ,"հակազդել","արատավոր","պահմտոցի","զրպարդություն","նախշ","գծանշան"
               ,"բնորդ","շաուրմա","բուրգեր","քոչարի","այգեգործ","հնադարյան","հուսախապ"
               ,"երազահան","հոթել","սողանք","սրբիչ","սպիտակեղեն","աքլոր","բերքատու"
               ,"բանջար","բարդի","հացենի","խրամատ","երջանկություն","ատել","փողոց","տայգա"
               ,"Եվրասիա","Գոնդովա","Լապլանդիա","ձյունանուշ","արդի","ատամ","Ադամ","Նոյ"
               ,"տապան","զույգ","կիսով չափ","ծովահեն","ծանծաղուտ","ծիրան","լուսան"
               ,"իջվածք","յուղ","ձեթ","ցնորհվել","միյավոր","տասնավոր","մոծակ","մողես"
               ,"ծիտիկ","ճաշակ","ավտոմեքենա","առագաստանավ","Տիտանիկ","հարություն"
               ,"գոգավոր","պատուհան","կարգապահ","սազ","կտծահարել"
               ,"կորիզ","քաղցր կաթ","վանիլին","դնչկալ","հովվաշուն","զանգ","զսպվածություն"
               ,"համեստ","համեմել","աղ","շաքարավազ","պատառ","սուտասան","կշեռք","կշիռ","կշռաքար"
               ,"քաշ","ծանր","թեթև","մոլախոտ","արու","էգ","Էսկիմո","եռուզեռ","զոհասեղան"
               ,"կռպազենք","քամի","սիրեկան","սիրուհի","օրօցք","սպանդանոց","անատոմիկ","զատիկ"
               ,"դեղատուն","դեղատոմս","դեղահաբ","դեղ","դարչին","դարչնագույն","բազմանկյուն"
               ,"հավասարասրուն","հավասարակողմ","կուղբ","քարացուկ","քարկապ","լուծարվել"
               ,"Պապ թագավոր","էլեկտրաբեր","սեխ","ձմերուկ","բադամ","սորտ","արտեզյան"
               ,"եթիմ","կիսաբաց","Երվանդ Քոչար","փաթեթ","սփխեչ"
               ,"կինոման","գին","խաղանիշ","ֆլեշմոբ","ֆոտոշոբ","նկարչություն","բիգուձի"
               ,"անլար","ակնաբուժ","անկյուն","աուդիտ","աուդիենցիա","արիստոլռատ"
               ,"ասպիրանտուրա","հոդաբոբ","հանրակառք","ինքնաշարժ"
               ,"մոգ","արտիստ","Իրան","անսամբլ","հասարակ"
               ,"աորտա","վերացական","ասիստենտ","անատոմիա","անարխիստ"
               ,"բառախաղ","հողմագիր","մանրադեպ","շահընկեր","բաժնետեր"
               ,"բաժնետոմս","ամպլուա","անալոգիա","ալիբի","ակորդ"
               ,"դուետ","տռիո","ագրեսիվ","ադապտացվել","բռնագանձել"
               ,"ցասում","պատվանդան","սևաճուճ","ճտապահ","բալ"
               ,"դրամատեր","դրամանիշ","գնդամուղ","կնկնեփիւկ"
               ,"բյուջե","բյուրո","մեծամասնական","արզնահող"
               ,"բրենդ","բրոնխիտ","տափաստան","կեռմայր","բուլյոն"
               ,"գամմա","գաստրոլ","նպարախանութ","գեն","գենետիկ"
               ,"գենոցիդ","հողաչափ","գիտաֆանտաստիկ","քաղցրիտ"
               ,"գլյիւկոզա","գլոբալիզացիա","գլոբուս","գրաֆիտ"
               ,"դայջեստ","ամբոխավար","ընկճախտ","աղանդեր"
               ,"դետալ","դիագրամ","հրաձայն","սննդականոն","սննդագետ"
               ,"երկընտրանք","խոսնակվ","ուժահան","կարգավար","խափանարար"
               ,"դիվերսիա","նվագավար","մաշկաբան","ուսմունք"
               ,"վարդապետ","կաթողիկոս","եպիսկոպոս","դրենաժ"
               ,"էգոիզմ","էլէկտրակիր","ընտրախավ","վերնախավ"
               ,"էլէկտրագետ","էմոցիոնալ","էնդոսկոպ","գեղագետ"
               ,"սահասանդուղք","էսքիզ","էվոլյուցիա","չափանշուշ"
               ,"էքսկուրսավար","ժյուրի","ձարշավորդ"
               ,"կատարելատիպ","ինդուստրիա","ճարտարապետ"
               ,"ինժեներ","անվանագիր","մտավորական","միջազգային"
               ,"ցինկ","ացետոն","ինտերվալ","բնազդ","ինտուիցիա"
               ,"ինֆորմատիկա","լաբարատորիա","ուղտայծ","լամա"
               ,"մսաշոթ","քաղցօղի","նշանաբառ","կոչ","լոխում"
               ,"շոգեքարշ","գրավատուն","լոռնետ","լուսամփոփ"
               ,"լուսակիր","խոլեստերին","հաշվիչ","կալցիում"
               ,"կամերտոն","թիթեղ","կապիտալ","լումա","մտրակ"
               ,"ցանկապատ","բաստուրմա","նրբերշիկ","երշիկ"
               ,"արքայանարինջ","չիր","չամիչ","պայթուցիկ"
               ,"սայլակ","հրավառություն","խուլ","կվարտետ"
               ,"հնգյակ","կրեդիտ","մշակույթ","կտրոն"
               ,"բուսարան","ջրասավառնակ","հիդրոֆոն"
               ,"հիերոգլիֆ","պատվագին","հումոր","բուսահող"
               ,"մանրակետ","համեմ","մաղադանոս","ճնշաչափ"
               ,"մարգարին","մարինադ","խամաճիկ","մաքսատուրք"
               ,"մեխանիկ","մետաղ","մանրէ","հեղուկ","իջևանատուն"
               ,"մոնոլիտ","մորֆին","մուտացիա","յոդ","ոչինչ","բառարան"
               ,"նևրոզ","շանսոն","շարֆ","ձևանմուշ","պանդա","պանդոկ"
               ,"շտաբ","դաշինք","բնապահպան","խորհրդարան","հարցազրույց"
               ,"օծանելիք","ոտնահարդարում","բնակիչ","խնդրագիր"
               ,"անիծքաշ","պլատին","պյուրե","բուժարան"
               ,"ներուժ","պրեմիերա","պրիզմա","քարոզել","արհեստավարժ"
               ,"պրոֆիլ","ռադիո","թևճակ","իրապշտ","անդրաձայն"
               ,"բեմադրիչ","ռեկորդ","վարկանիշ","հայացք","ռիթմ"
               ,"համազարկ","ռոբոտ","չափերիզ","հատված","սենատոր"
               ,"սենդվիչ","գլան","սիմֆոնիա","արեստ","արվեստ","սկանդալ"
               ,"սկլերոզ","սոլո","սոցիալական","սպեկտոր","սպորտ"
               ,"վիճակագրություն","հանդիսավար","վիտամին","տարա"
               ,"գնացուցակ","տերմին","տոն","մրցաշար","զբոսաշրջիկ"
               ,"հատել","ունիվերսալ","քիմիկոս","Չարլզ Դարվին","օբյեկտիվ"
               ,"առցանց","օպերա","հիմնադրամ","ջրցան","Մարտիրոս Սարյան"
               ,"պոեմ","սուրահ","գերի","նկարիչ","հարված"
               ,"դարպասապահ","կիսապաշտպան","թենզս","ստորակետ"
               ,"բութ","կառույց","պարետ","մտախոհ","հող","հողագործ"
               ,"պալատ","Վան","հարասում","բորենի","Կոլումբոս"
               ,"իշամեղու","Իոսիվ Ստալին","բախտատեր","Երուսաղեմ"
               ,"Իսրաել","հնդիկ","Եգիպտոս","Խաչատուր Աբովյան","Լուսիզա Ներսիսյան"
               ,"Հրանդ Թոխատյան","Տամարա Պետրոսյան","Պոնչ Իսպիրյան","Գարիկ Պապոյան"
               ,"Անդե","Գալիա Նովենց","Գալիա Արզումանյան","Հովհանես Դավթյան","Սոնա Մաթևոսյան"
               ,"Ռաֆաել Երանոսյան","Հակոպ Պարոնյան","թատրոն","կինոթատրոն","ակվարիում"
               ,"ձկնորս","դույլ","կարթ","Նեղոս","նեղուց","լայն","լայնություն","անտառ"
               ,"սփյուռք","միլիարդ","կապանք","կաշի","մորթի","միս","շուն","ձագար"
               ,"ձու","կրիա","պատյան","մեջք","փոր","խաշլամա","տապակել"
               ,"տզրուկ","սլաք","թամբ","աղվամազ","դատարկել","հաչոց"
               ,"մլավել","արտադրանք","տաքացնել","տառապել","ննջել"
               ,"ավիրել","աշխույժ","թաթ","Չինաստան","քրոնիկ","մահաբեր"
               ,"թունավոր","կեռաս","բնական","տհաճ","խելք","միամիտ"
               ,"կոպիտ","հովիվ","մատնոց","քիթ","զարհուրել","զարմանք"
               ,"կաթիլ","կտուց","բերան","կնճիռ","խորամանկ","աղվես","կողպեք"
               ,"բանալի","բացել","փական","հեղինակ","երկրպագու","Վան Գոգ","Բեթհովեն"
               ,"օդաչու","օդանավ","Մոցարտ","մաեստռո","վիրտուոզ","բրավո"
               ,"գրին քարտ","կապոց","թղթախաղ","խաղաթուղթ","լայմ","լարված"
               ,"տատանում","երկրաշարժ","հրդեհ","բռնկում","խեղդվել","բզկտվել"
               ,"աղցան","աննշմար","քնքուշ","իրիկնաժամ","թփեր","ուրու"
               ,"մեղմիկ","շոյել","գնումներ","նարդի","բլոտ",""
            ]            


        





var barer = [
    "ատար", "խոպսուր", "սեղան", "հաելի", "ձվածեղ",
    "գրոխոդ", "վինտիլ", "բառաբան", "կառդան", "գլազուր",
    "բելառուս", "անբախտ", "միճակ", "բասմա", "կռակադիլ", "թիթեն"
    , "լիմոնկա", "եղան", "բայ", "կովբոյ", "կուբին", "աստեռոիդ"
    , "բան", "վիրուս", "խոպան", "զիբիլ", "Պեմզաշեն", "Չրախլի"
    , "կանալ", "ակոս", "բիճոկ", "նարդի", "բլոտ", "ջորի", "տանկիստ"
    , "լամբուշկա", "ատոմային", "չստիկ", "ծիպուգ", "բոստան", "գուտան"
    , "թրիք", "պռես", "սկատեռ", "ստեպլեռ", "մագնիտո", "գալովկա", "քյադակ վալ"
    , "շտոկ", "դազգյա", "շարկացան", "սպարտիվկա", "պլաշ", "օրունգ", "օրենք", "նասատկա"
    , "տոկառ", "ստանոկ", "բալգառկա", "դռել", "տմբուշկա", "բարձ", "վինետկա", "Վլադիմիր Պուտին", "իզալենդ"
    , "ղայֆա", "թրաշ", "մոդեմ", "զանավեսկա", "ստեղնաշար", "փիլաքյան", "Պարույր Սեվակ", "ղֆիլ", "դիմախոդ"
    , "դուռդմա", "դուրգյար", "խնոցի", "սեբերատուր", "Օբեկտ", "Դիվիդի", "ֆեն", "վառոդ", "խադավիկ"
    , "վիծիշկա", "լորանոց", "դուս", "մութ", "գոմ", "մարգոս", "չապա", "թռչուն", "բրիսոկ", "գերնդի"
    , "բունկեռ", "սիլոս", "սենաժ", "կանոլ", "աղինջ", "փոլոլ", "թեպ", "ռոդմանս", "ստյաշկա", "շպախլովկա"
    , "պռավիլ", "մայակ", "կառոնկա", "սվեռլո", "զացիրկա", "պատշար", "պապըս", "տատիս մառդը", "սխոց"
    , "մատնիկ", "մեխ", "սամառեզ", "Դեսպէ", "դեվեպե", "տռի-չետվեռ", "նապռակատ", "գրիչ", "տանձ"
    , "ավոկադո", "չեռիմոյա", "կատնուկ", "ավելուկ", "սեզ", "ոռձ խոտ", "արևածագ", "ծագ", "դեղ"
    , "ժուկ", "անտենա", "էլէմենտ", "կալենդար", "տուզ", "վալետ", "դամա", "հակագազ", "փիղ"
    , "արմատուր", "ֆոռտուշկա", "զսպանակ", "ղվան", "կլապան", "Տապասիա", "լոնդոն", "ճիլիկ-ճիբոտ"
    , "պուբլիզատոր", "Ապոկա", "լոգարիթմ", "թույն", "ավչառկա", "ջերմուկ", "լոմբառդ", "պասպոռտ", "գեղ"
    , "լեննական", "էրինջ", "ղապախկ", "ծամոն", "դալ", "պիսմեննի", "դուգա", "լֆիկ", "քյաբաբ", "ավտոմատ"
    , "հին", "կոմբայնավար", "անտաղանդ", "լվածք", "աբառոտ", "ասֆալտ", "քնձըխ", "մասսա"
    , "ռումբ", "Ակադեմիա", "բալնիկ", "ժանգ", "չոռ", "ճոռ", "շնեգ", "տուլկի", "բիլագ", "սվիստոկ", "կոբալ"
    , "բուտկա", "օսկի", "պատ", "ցխավել", "բիսետկա", "քոք", "սմբակ", "եղնի մատ", "Աբարան"
    , "Վրաստան", "մանդալին", "նոր տարի", "ծախս", "վարկ", "հերդ", "գեղի հերոս", "դինամ"
    , "պուսկաջ", "տավռիկ", "մարակ", "դեզ", "ազգ", "մաիշկա", "առևտրական", "յաշիկ", "առևտրական"
    , "մազ", "կվալտ", "տրուբա", "սավոկ", "ֆոռդ", "զամոկ", "չխոլ", "բարութ", "բիզոն", "թութ"
    , "ցելաֆոն", "տուկի թել", "բոտաս", "ղազաբ", "Վառշամ", "ցվըրվել", "սաբոն", "սրինգ", "շվի"
    , "Տիգրան Ավդալյան", "պզուկ", "վիզ", "թքել", "սրինգ", "տրմբովկա", "մազի ռեզին", "հուշարձան"
    , "ժամ", "ջեզ", "նոկիա", "քյալփաթին", "փուռչ", "տուն", "ջիլ", "փչել", "շլանգ", "մալ"
    , "յոնջա", "կորնգալ", "սվարկա", "ամիս", "պարապ", "ռեմոնտ", "ԿաԴե", "Երևան", "օպյակ"
    , "ծախել", "խոշոր", "Արազ", "Արաբո", "ազգ", "կապել", "ուրղան", "ուրբան", "ծյունինգ"
    , "պայկա", "աբյոմ", "չապուկ", "տառթ", "երգել", "հարսանիք", "փեդեթվանք", "ֆուրղուն"
    , "փխրուն", "փշուր", "մոստ", "քուր", "մեխանիկ", "կառկազ", "գյուղապետարան", "հող"
    , "կաթ", "զապաս", "պալիգոն", "ձոր", "պարադանյութ", "ալրել", "անգյալ", "րոպե", "կասիլկա"
    , "աշուն", "ձմեռ", "ամառ", "գարուն", "կոջ", "պարտք", "ցանկս", "ավիոզ", "կուկուռուզ"
    , "կարտոլ", "չորային", "երաժտ", "գրուպա", "խելոք", "ռեժիմ", "մեռել", "գերեզմններ"
    , "զաժիգալկա", "ֆռեզ", "տանգ", "կարտոլ", "փորել", "սանտիմետր", "ախպեր", "տարիք"
    , "կենտանի", "շուխուր", "կիրճ", "թեժ", "կապտիտել", "բոյ", "քյոռփա", "տամբատ", "փչանալ"
    , "կալոս", "ռամ", "ուտիլ", "պճեխ", "սերմ", "անջրդի", "վասմի", "պլան", "սկամեյկա", "բլոկ"
    , "ճտճտիկ", "կլուչ", "ատամի ցավ", "փերֆերատր", "արոջ", "ջուր", "երկուշաբթի", "իրեքշաբթի"
    , "կիրակի", "ուրբաթ", "շաբաթօրյակ", "ծառատունկ", "ցորեն", "ստեպճել", "ֆազ", "նոլ"
    , "կաթիլ", "ճիրալ", "տուռբո", "ազոտ", "ազբեստ", "ստեկլավատ", "պեռեմիշկա", "պեռեկիտկա"
    , "չիվի", "կալուն", "կաֆել", "սորտավո", "եռունդա", "օյին", "կռիշ", "կտուր", "կատար", "կառնեզ"
    , "ռեյկա", "խմել", "ուգլ", "տռապ", "օձ", "սարդ", "փետ ջարդել", "ոստ", "զիբիլ", "վիշիլկա"
    , "ցանել", "քաղել", "էտել", "բազար", "կիրով", "Սայաթ Նովա", "ռագատկա", "նետ ու աղեղ"
    , "սրել", "մանգաղ", "փոցխ", "խորունգ", "լոռդու", "լղար", "նկար", "գազ", "սայլարկա"
    , "բենզին", "յուղ", "տավոտ", "ժիտկստ", "անտիֆռիզ", "նաֆթ", "պիդիսյատ", "զիլ"
    , "կռան", "կամազ", "պագռուզչիկ", "գռուզչիկ", "Էքսկավատոր", "ջոն դեեռ", "ջազվա"
    , "ռաբիզ", "Թաթա", "մուզիկա", "ցեպ", "ոլֆրամ", "գրանիտ", "գռուզ", "վանտակ"
    , "մարդ", "կնիգ", "կիսուր", "կեսրայր", "տալ", "աներձակ", "պիթոն", "ունիվալնիկ"
    , "ռուս", "գառ", "ոչխար", "դիսկո", "վիսկի", "ծեփոն", "գառմոշկա", "ակառդիոն"
    , "քիռպիջ", "պետլի", "ուգոլնիկ", "շիֆր", "պալասա", "կատանկա", "թամասուկ", "գանել"
    , "ֆոլգա", "նարգիլա", "շլոր", "աբոյ", "ներկ", "վետրբազ", "լազեր", "ուռովեն"
    , "նակիտնո", "գաիշնի", "դպռոց", "փուշնաֆտուլ", "ուսիլիտ", "ուցեպլիտ", "մառոլ", "թարխուն"
    , "կանաչ", "սիբեխ", "սինձ", "զոխ", "երիշնա", "թթու", "թթվաշ", "թսկել", "անձրև", "հարևան"
    , "դողալ", "թնդիր", "բեշիքյարթմա", "տուժել", "առժանի", "հարիֆ", "բարև", "լուր"
    , "սպասել", "բուկսավատ", "աչքեր", "ոչմեկ", "բլդուղ", "կտտոր", "մսուրկ", "բու", "խմոց"
    , "թուպուզ", "չախլդախ", "գյուլաշ", "կոխ", "կուտ", "գարի", "դուռակ", "ձմերուկ", "այգեպան"
    , "Թորոս", "սվեչա", "կալոդ", "ժակետ", "ցեց", "ճակատ", "կառթ", "ժեշտ", "չափ", "նյութ"
    , "շինել", "բռոնզ", "դեղին", "տուլկի", "ստուպիցա", "պալեց", "ճիշտ", "վիբռացիա", "ծալել"
    , "սիստեմ", "սխեմա", "եղունգ", "հեռախոս", "փեշ", "պեշկ", "թռնել", "մագ", "ճանճ", "շուռուպ"
    , "ատվյոռկա", "վոլտ", "ամպեռ", "բռուս", "առենդ", "փող", "լիստ", "եժան", "ժողովուրդ"
    , "խեր", "շառ", "գործ", "տրաքել", "հաց", "խոտքաղ", "քշել", "խամ", "հարոս", "ղազմա", ".ղոլտուղ"
    , "քեչա", "կնպկա", "պալտոն", "աբե", "գռուդինկա", "ժում", "կռուշկա", "սոլուղ", "հավկիտ", "պոնչիկ"
    , "ճարել", "փռշտալ", "պիսոկ", "աջարական", "խորիզ", "գաթա", "փոքր", "իստկել", "ջիգյար"
    , "թոզ", "մաղադանոս", "թերմաշ", "սինի", "ակռոշկա", "տառելկա", "հարգել", "ավանծյունիստ"
    , "սասսկի", "սանր", "սև", "ծնգցել", "տապոռ", "զապո", "կուվետ", "քուզ", "պեխ", "շիշ", "շարբատաջուր"
    , "խաս", "լիրբ", "տեքերկին", "բումաժնիկ", "սարանդոստիկ", "լոշտակ", "հրեշտակ", "պապիռոզ"
    , "մուշտուկ", "պեպենիցա", "հայվան", "կաստետ", "ապառատ", "շիտոկ", "աբլիղովկա", "չբլաղ"
    , "գեյզեր", "տախտակ", "զարի զամբա", "բարակ", "անկապ", "շամպուր", "վախ", "գառդիրոպ"
    , "օրօսկ", "ջրվեժ", "ջինտոնիկ", "պակաս", "բեդովլատ", "ձեռնթյուխ", "ղանջղ", "սենյակ"
    , "շնտռկել", "պաստավկա", "ղուռումսաղ", "քյասաֆատ", "անֆայմ", "ճուռճուռ", "պեկաժ"
    , "շիտիլ", "բոլոկի", "գյոռմամիշ", "ոտաստակ", "չախլամա", "խռճոլակ", "բողազ",,"ղոլտուղ","դոլվաթ"
    ,"գյոյնա","ժոստիկ","պուլտ","դինամիկ","ղրաղ","ղափամա","քերել","քիստղ","յայլա","յատաղ"
    ,"պոլոզ","մազուտ","մուր","մրկաթ","Մաստարա","դանգիզ","սուսլիկ","սար","ձորամեջ","գյուղամեջ"
    ,"լազվել","ղարավուրդ","բեզրել","դինջանալ","մատավիլ","սոխջուր","սխտոր","Սարյար","Ղուգասյան"
    ,"ջարդ","նվազ","սերմնացան","գլխավար","պոլդույմ","գաբառիտ","բաս","բազալտ","մատաղ"
    ,"մազոլ","քաչալ","քերոպ","գող","զակոն","զրբանց","շինշիլա","սամսար","տրակտոր"
    ,"սալոմ","խոտ","հազալ","քղկալ","ալջակ","ցրցամ","մոշ","մուշտուկ","կապիշոն","ավազ"
    ,"ցեմենտ","շիբին","ճիջու","լրբնալ","լոմկուլ","էլէկտրոդ","սվառկա","ծառս","մամզիլ","օսյատ"
    ,"ազարտ","սայլուտ","ջրալի ճաշ","ջրբաժան","գերմանկա","գրուզավիգ","շոպլիկ","չուխան"
    ,"կլուչնիկ","դավադիտ","մախ","գաղապար","ռանջպար","եղբար","զուլալ","զնդան","ռելիս"
    ,"պոեզ","կռիս","նարնազիր","սֆատ","պլստալ","փուստ","Կիրովական","Հոկտեմբերյան"
    ,"պենջակ","գալստուկ","կենաց","շխկալ","շուլուխչի","հեկտար","բակ","զապռավկա","զասավիտ"
    ,"զաչոմարիտ","ձակառ","մաղ","քամիչ","սեբերատուր","պեճատ","Շիրակ","շոր","ղազմա"
    ,"ղումար","անանաս","դիշովկա","հրել","խորոզ","խորոզլամիշ","քսի տալ","կեռճան"
    ,"յակռ","յազվա","քացախ","սզու","աստղով","պռոստին","իսան","գազան","գզվել"
    ,"գզուզ","գուբախտ","կիլդիմ","սուզմա","ջրեզ","լաֆետ","կուզով","ներկ","կեռխեր"
    ,"նարգիլա","կալիան","դալտոնիկ","կաստետ","կասլետ","բուֆեր","պետլի","գնդապետ"
    ,"ուչեպկա","վայենի","վարակ","նագահ","կոտոշ","նամոռնիկ","կառկազ","ոռձ","էսկիմո"
    ,"տուպիտ","խեդեր","ծիագա","լուլկի","մսացու","քերթել","թանազուկ","ջուխտ","բառբա"
    ,"բախտատեր"

]



var sepakan = []

for (let i = 0; i < barer.length; i++) {
    if (barer[i]==undefined) {
        barer[i]=barer[barer.length-1]
        barer[barer.length-1]=barer[i]
        barer.pop()
    }
}

for (let s = 0; s < barers.length; s++) {
    if (barers[s]==undefined) {
        barers[s]=barers[barers.length-1]
        barers[barers.length-1]=barers[s]
        barers.pop()
    }
}
for (let m = 0; m < sepakan.length; m++) {

    if (sepakan[m]==undefined) {
        sepakan[m]=barers[sepakan.length-1]
        sepakan[sepakan.sepakan-1]=sepakan[m]
        sepakan.pop()
    }
}


var xar = barers.concat(barer,sepakan)


console.log(barers.length);


var adudio = "./audio/cng.mp3"
var audioLA = new Audio(adudio);
var cnlg = "./audio/bud.mp3"
var bud = new Audio(cnlg)
var sad = "./audio/end.mp3"
var ends = new Audio(sad)
var kns = "./audio/k1.mp3"
var k = new Audio(kns)
var gs = "./audio/k2.mp3"
var gss = new Audio(gs)
var dignd = "./audio/eror.mp3"
var dong  = new Audio(dignd)
var postbox = "./audio/pox.mp3"  
var post = new Audio(postbox)


var xaxal = document.getElementsByClassName("xaxal")
var imgs = document.getElementsByClassName("bask")
var harc = document.getElementsByClassName("harc")
var durs = document.getElementsByClassName("durs")
var kox = document.getElementsByClassName("kox")
durs[0].addEventListener("click",durss)
kox[0].addEventListener("click",koxbenk)
function durss () {
   k.play()
   setTimeout(() => {
    window.close()  
   }, 100);
   

   
}
var a = 0



function koxbenk() {
    k.play()
    document.body.removeChild(this)
    document.body.removeChild(imgs[0])
    document.body.removeChild(xaxal[0])
     document.body.removeChild(durs[0]) 
     document.body.removeChild(harc[0]) 

var koxbdiv = document.createElement("div")
document.body.append(koxbdiv)
koxbdiv.setAttribute("class","koxbdiv")
      
var p = document.createElement("p")
koxbdiv.append(p)
p.setAttribute("class","koxp")
p.innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել"
p.style.color = "red"

   

var baj = document.createElement("select")
baj.setAttribute("class", "koxbaj")
koxbdiv.appendChild(baj)
var baj1 = document.createElement("option")
baj.append(baj1)
baj1.textContent = "Ընտրեք բաժինը"
var baj2 = document.createElement("option")
baj.append(baj2)
baj2.textContent = "Սովորական"
baj2.setAttribute("class","sovorakan")
var baj3 = document.createElement("option")
baj.append(baj3)
baj3.textContent = "Օբեկտի խաղ"
baj3.setAttribute("class","obekt")

var baj4 = document.createElement("option")
baj.append(baj4)
baj4.textContent = "Խառը"
baj4.setAttribute("class","xarax")  


if (exav==0) {
    var baj5 = document.createElement("option")
baj.append(baj5)
baj5.textContent = "Ավելացնել բաժին ..."
baj5.setAttribute("class","avel")
}
  
else if (exav==1) {
    var baj5 = document.createElement("option")
baj.append(baj5)
baj5.textContent = im
baj5.setAttribute("class","imna")
}




var inpa =document.createElement("input")
koxbdiv.append(inpa)
inpa.setAttribute("type","text")
inpa.setAttribute("class","koxi")
inpa.setAttribute("placeholder","ներմուծեք")


var indiv = document.createElement('div')
koxbdiv.append(indiv)
indiv.setAttribute("class","indiv")

var koxmi = document.createElement("input")
koxmi.setAttribute("type","button")
koxmi.value = "Ավելացնել"
indiv.append(koxmi)
koxmi.setAttribute("class","koxmbut")
koxmi.addEventListener("click",addpush)


var koxmi2 = document.createElement("input")
koxmi2.setAttribute("type","button")
koxmi2.value = "Հեռացնել"
indiv.append(koxmi2)
koxmi2.setAttribute("class","koxmbut2")
koxmi2.addEventListener("click",delpush)
// koxmi.setAttribute("align","center")
var hetsa = document.createElement("img")
hetsa.setAttribute("src","./img/het.png")
koxbdiv.append(hetsa)
hetsa.setAttribute("class","hets")










hetsa.onclick = function (params) {
  
    k.play()
if (exav == 0) {
    document.body.removeChild(koxbdiv)
    // this.style.backgroundColor = "red"
var imgner = document.createElement("img")
document.body.append(imgner)
imgner.src = "./img/bard.png"
imgner.setAttribute("class","bask")



var xaxanal = document.createElement("input")
xaxanal.setAttribute("type","button")
xaxanal.value = "Խաղալ"
document.body.append(xaxanal)
xaxanal.setAttribute("class","xaxal")
xaxanal.setAttribute("align","center")



var dursa = document.createElement("input")
dursa.setAttribute("type","button")
dursa.value = "Դուրս գալ"
document.body.append(dursa)
dursa.setAttribute("class","durs")
dursa.setAttribute("align","center")
dursa.addEventListener("click",durss)


var harcak = document.createElement("img")
harcak.setAttribute("src","./img/harc.png")
document.body.append(harcak)
harcak.setAttribute("class","harc")
harcak.addEventListener("click",harcs)
xaxanal.addEventListener("click",xaxala)



var koxs = document.createElement("img")
koxs.setAttribute("src","./img/kox.png")
document.body.append(koxs)
koxs.setAttribute("class","kox")
 koxs.addEventListener("click",koxbenk)
}
else if (exav==1) {
  
    
if (sepakan.length>=6) {
    document.body.removeChild(koxbdiv)
    // this.style.backgroundColor = "red"
var imgner = document.createElement("img")
document.body.append(imgner)
imgner.src = "./img/bard.png"
imgner.setAttribute("class","bask")



var xaxanal = document.createElement("input")
xaxanal.setAttribute("type","button")
xaxanal.value = "Խաղալ"
document.body.append(xaxanal)
xaxanal.setAttribute("class","xaxal")
xaxanal.setAttribute("align","center")



var dursa = document.createElement("input")
dursa.setAttribute("type","button")
dursa.value = "Դուրս գալ"
document.body.append(dursa)
dursa.setAttribute("class","durs")
dursa.setAttribute("align","center")
dursa.addEventListener("click",durss)


var harcak = document.createElement("img")
harcak.setAttribute("src","./img/harc.png")
document.body.append(harcak)
harcak.setAttribute("class","harc")
harcak.addEventListener("click",harcs)
xaxanal.addEventListener("click",xaxala)



var koxs = document.createElement("img")
koxs.setAttribute("src","./img/kox.png")
document.body.append(koxs)
koxs.setAttribute("class","kox")
 koxs.addEventListener("click",koxbenk)


}

else{

var ps = document.getElementsByClassName("koxp")
ps[0].style.fontSize  = "32px"
ps[0].innerHTML = "Ավելացերք մինիմումը 6 բառ ձեր ստեղծած բաժնում"




}


}
 
}






}




function addpush() {
 k.play()

   var inp = document.getElementsByClassName("koxp") 
   var inbaj = document.getElementsByClassName("koxbaj") 
   var inpi = document.getElementsByClassName("koxi") 
   var inp = document.getElementsByClassName("koxp") 
var bajin = inbaj[0].value
var bara = inpi[0].value       
if (bajin == "Սովորական"||bajin == "Օբեկտի խաղ"||bajin == "Խառը") {

if (bajin == "Սովորական"&&inpi[0].value!="") {
    
    
     barers.push(bara)
   
   inp[0].innerHTML = "Բառը ավելացավ"
   inp[0].style.fontSize  = "32px"
   inp[0].style.color = "green" 
   
   inpi[0].value  = ""
   setTimeout(() => {
    inp[0].innerHTML ="Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
    inp[0].style.color = "red" 
    inp[0].style.fontSize  = "17px"
   }, 1000);


}

else if (bajin == "Օբեկտի խաղ"&&inpi[0].value!="") {
 
    barer.push(bara)
  if(inp.value  != ""){
      inpi[0].value =""
  inp[0].innerHTML = "Բառը ավելացավ"
  inp[0].style.fontSize  = "32px"
  inp[0].style.color = "green" 
  setTimeout(() => {
   inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
   inp[0].style.color = "red" 
   inp[0].style.fontSize  = "19px"
  }, 1000);


}
}

else if (bajin == "Խառը"&&inpi[0].value!="") {
    
     
    xar.push(bara)
 
 
    inpi[0].value  = ""
  inp[0].innerHTML = "Բառը ավելացավ"
  inp[0].style.color = "green" 
  inp[0].style.fontSize  = "32px"
  setTimeout(() => {
   inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
   inp[0].style.color = "red" 
   inp[0].style.fontSize  = "17px"
  }, 1000);


}



     
 }


else if (bajin=="Ավելացնել բաժին ...") {
    
    if (inpi[0].value !="") {
        im = bara
        exav = 1
        inp[0].innerHTML = "բաժինն ավելացավ" 
        inp[0].style.fontSize = "32px"
    


        var hin = document.getElementsByClassName("avel")
inbaj[0].removeChild(hin[0])


     var ssbaj = document.createElement("option")
     ssbaj.setAttribute('class',"imna")
     inbaj[0].append(ssbaj)
      ssbaj.textContent = im
  inpi[0].value = ""


        inp[0].style.color = "green" 
        setTimeout(() => {
         inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
         inp[0].style.color = "red" 
         inp[0].style.fontSize = "17px"
        }, 1200);
     
        
    }



}
else if (bajin == im) {
    
 if (inpi[0].value !="") {
    inpi[0].value =""
    sepakan.push(bara)
    inp[0].value  = ""
  inp[0].innerHTML = "Բառը ավելացավ"
  inp[0].style.fontSize = "32px"
  inp[0].style.color = "green" 
  setTimeout(() => {
   inp[0].innerHTML ="Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
   inp[0].style.color = "red" 
   inp[0].style.fontSize = "17px"
  }, 1200);

    


 }   
}


}
function delpush() {
    k.play()
    var inp = document.getElementsByClassName("koxp") 
    var inbaj = document.getElementsByClassName("koxbaj") 
    var inpi = document.getElementsByClassName("koxi") 
    var inp = document.getElementsByClassName("koxp") 
 var bajin = inbaj[0].value
 var bara = inpi[0].value       
 if (bajin == "Սովորական"||bajin == "Օբեկտի խաղ"||bajin == "Խառը") {
 
 if (bajin == "Սովորական"&&inpi[0].value!="") {

if (bara!="Սովորական") {
    for (let b = 0; b < barers.length; b++) {
        if (barers[b]==bara) {
           barers[b] = barers[barers.length-1] 
           barers[barers.length-1] = barers[b]
           barers.pop()
           inp[0].innerHTML = "Բառը ջնջվեց"
           inp[0].style.color = "green" 
           inp[0].style.fontSize  = "32px"
           setTimeout(() => {
            inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
            inp[0].style.color = "red" 
            inp[0].style.fontSize  = "17px"
           }, 1000);
        
        }
        else{

           inp[0].innerHTML = "Բառը գոյություն չունի"
           inp[0].style.color = "red" 
           inp[0].style.fontSize  = "32px"
           setTimeout(() => {
               inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
               inp[0].style.color = "red" 
               inp[0].style.fontSize  = "17px"
              }, 1000);
        }
           
       }


    
     inpi[0].value  = ""
  


}
else if (bara=="Սովորական") {
    var sovs = document.getElementsByClassName("sovorakan")
    inbaj[0].removeChild(sovs[0])

    inp[0].innerHTML = "Բաժինը ջնջվեց"
    inp[0].style.color = "green" 
    inp[0].style.fontSize  = "32px"
    setTimeout(() => {
     inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
     inp[0].style.color = "red" 
     inp[0].style.fontSize  = "17px"
    }, 1000);
    inpi[0].value = ""
}

       
 
 
 }
 
 else if (bajin == "Օբեկտի խաղ"&&inpi[0].value!="") {
   
  if (bara !="Օբեկտի խաղ") {
      

    for (let b = 0; b < barer.length; b++) {
        if (barer[b]==bara) {
           barer[b] = barer[barer.length-1] 
           barer[barer.length-1]  = barer[b]
           barer.pop()
           inp[0].innerHTML = "Բառը ջնջվեց"
           inp[0].style.color = "green" 
           inp[0].style.fontSize  = "32px"
           setTimeout(() => {
            inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
            inp[0].style.color = "red" 
            inp[0].style.fontSize  = "17px"
           }, 1000);
        
        }
        else{

           inp[0].innerHTML = "Բառը գոյություն չունի"
           inp[0].style.color = "red" 
           inp[0].style.fontSize  = "32px"
           setTimeout(() => {
            inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
            inp[0].style.color = "red" 
            inp[0].style.fontSize  = "17px"
           }, 1000);
          
        }
           
       }


    
     inpi[0].value  = ""
  }
else if (bara =="Օբեկտի խաղ") {


    var sovs = document.getElementsByClassName("obekt")
    inbaj[0].removeChild(sovs[0])

    inp[0].innerHTML = "Բաժինը ջնջվեց"
    inp[0].style.color = "green" 
    inp[0].style.fontSize  = "32px"
    setTimeout(() => {
     inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
     inp[0].style.color = "red" 
     inp[0].style.fontSize  = "17px"
    }, 1000);
    inpi[0].value = ""


}
    
 
 
 
 }
 
 else if (bajin == "Խառը"&&inpi[0].value!="") {
     
      if (bara!="Խառը") {
        for (let b = 0; b < xar.length; b++) {
            if (xar[b]==bara) {
                xar[b] = xar[xar.length-1] 
                xar[xar.length-1]  = barers[b]
                xar.pop()
               inp[0].innerHTML = "Բառը ջնջվեց"
               inp[0].style.color = "green" 
               inp[0].style.fontSize  = "32px"
               setTimeout(() => {
                inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
                inp[0].style.color = "red" 
                inp[0].style.fontSize  = "17px"
               }, 1000);
            
            }
            else{
    
               inp[0].innerHTML = "Բառը գոյություն չունի"
               inp[0].style.color = "red" 
               inp[0].style.fontSize  = "32px"
               setTimeout(() => {
                inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
                inp[0].style.color = "red" 
                inp[0].style.fontSize  = "17px"
               }, 1000);
            }
               
           }
    
    
        
         inpi[0].value  = ""  
      }
   
else if (bara=="Խառը") {
    
    var sovs = document.getElementsByClassName("xarax")
    inbaj[0].removeChild(sovs[0])

    inp[0].innerHTML = "Բաժինը ջնջվեց"
    inp[0].style.color = "green" 
    inp[0].style.fontSize  = "32px"
    setTimeout(() => {
     inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
     inp[0].style.color = "red" 
     inp[0].style.fontSize  = "17px"
    }, 1000);
    inpi[0].value = ""

}
 
 
 }
 


 
 
 
 
      
  }
   else if (bajin == im) {
     if (bajin == im&&inpi[0].value!="") {
      
    
    
        
      if (bara != im&&inpi[0].value!="") {
        
          
        for (let b = 0; b < sepakan.length; b++) {
            if (sepakan[b]==bara) {
                sepakan[b] = sepakan[sepakan.length-1] 
                sepakan[sepakan.length-1]  = barers[b]
                xar.pop()
               inp[0].innerHTML = "Բառը ջնջվեց"
               inp[0].style.color = "green" 
               inp[0].style.fontSize  = "32px"
               setTimeout(() => {
                inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
                inp[0].style.color = "red" 
                inp[0].style.fontSize  = "17px"
               }, 1000);
            
            }
            else{
    
               inp[0].innerHTML = "Բառը գոյություն չունի"
               inp[0].style.color = "red" 
               inp[0].style.fontSize  = "32px"
    
               setTimeout(() => {
                inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
                inp[0].style.color = "red" 
                inp[0].style.fontSize  = "17px"
               }, 1000);
              
            }
               
           }
    
    
        
         inpi[0].value  = ""
        
       
      }
     else if (bara==im&&inpi[0].value!="") {
         
         
        var sovs = document.getElementsByClassName("imna")
        inbaj[0].removeChild(sovs[0])
    
        inp[0].innerHTML = "Բաժինը ջնջվեց"
        inp[0].style.color = "green" 
        inp[0].style.fontSize  = "32px"
        setTimeout(() => {
         inp[0].innerHTML = "Այս բաժինը նախատեսված է բառեր կամ բաժիններ ջնջելու կամ ավելացնելու համար:Եթե ընտրել եք «ավելացնել բաժին» ներքևի տողում գրեք բաժնի անունը:ԵՎ Կարող եք ավելացնել ընդամենը 1 բաժին,բաժինն ավելացնելուց հետո այդ բաժնում ավելացնում եք առնվազն 6 բառ:Բաժինը ջնջելու համար ընտրեք այդ բաժինը և «ներմուծեք» դաշտում գրեք այդ բաժնի անունը և սեղմեք հեռացնել:"
         inp[0].style.color = "red" 
         inp[0].style.fontSize  = "17px"
        }, 1000);
        inpi[0].value = ""
        exav = 0

        var zuzu = document.createElement("option")
        inbaj[0].append(zuzu)
        zuzu.textContent = "Ավելացնել բաժին ..."
        zuzu.setAttribute("class","avel")



     }
        
     
     }
       
       
   }



 
 }
 












 function harcs() {
   
k.play()

var jl =document.getElementsByClassName("jav")
if (imgs[0]) {
    document.body.removeChild(this)
    document.body.removeChild(imgs[0])
    document.body.removeChild(xaxal[0])
     document.body.removeChild(durs[0]) 
     document.body.removeChild(kox[0]) 
}
if (jl[0]) {
    document.body.removeChild(jl[0])
}





var hzor = document.createElement("div")
document.body.append(hzor)
hzor.setAttribute("class","hzor")
var  vern = document.createElement("h1")
hzor.append(vern)
vern.setAttribute("class","vern")
vern.innerHTML = "Կանոններ"
vern.setAttribute("align","center")
var p = document.createElement("p")
hzor.append(p)
p.setAttribute("class","kanon")
p.innerHTML = "Այս խաղը խաղում են առնվազն 2 հոգի,խաղը սկսելուց առաջ մասնակիցները բաժանվում են թիմերի:Թիմերի բաժանվելուց հետո խաղը սկսում է առաջին թիմը և թիմերը հերթով էկրանին գրված բառը բացատրում են իրենց մասնակիցներին ՝ առանց գրված բառի արմատը օգտագործելու, որ թիմը վասակեց այնքան միյավոր,որքան նշված է այդ թիմնել հաղթում է:"
// var br = document.createElement("br")
// hzor.append(br)  

var c = document.createElement("img")
c.src = "./img/c.png"
c.setAttribute("class","c")
hzor.append(c)
c.addEventListener("click",java)


var hetdiv = document.createElement("div")
hzor.append(hetdiv)
hetdiv.setAttribute("class","hetdiv")

var het = document.createElement("img")
het.setAttribute("src","./img/het.png")
hetdiv.append(het)
het.setAttribute("class","het")
 het.setAttribute("align","center")





het.onclick = function () {
    k.play()
    this.style.backgroundColor = "red"
document.body.removeChild(hzor)
var imgner = document.createElement("img")
document.body.append(imgner)
imgner.src = "./img/bard.png"
imgner.setAttribute("class","bask")



var xaxanal = document.createElement("input")
xaxanal.setAttribute("type","button")
xaxanal.value = "Խաղալ"
document.body.append(xaxanal)
xaxanal.setAttribute("class","xaxal")
xaxanal.setAttribute("align","center")



var dursa = document.createElement("input")
dursa.setAttribute("type","button")
dursa.value = "Դուրս գալ"
document.body.append(dursa)
dursa.setAttribute("class","durs")
dursa.setAttribute("align","center")
dursa.addEventListener("click",durss)


var harcak = document.createElement("img")
harcak.setAttribute("src","./img/harc.png")
document.body.append(harcak)
harcak.setAttribute("class","harc")
harcak.addEventListener("click",harcs)
xaxanal.addEventListener("click",xaxala)



var koxs = document.createElement("img")
koxs.setAttribute("src","./img/kox.png")
document.body.append(koxs)
koxs.setAttribute("class","kox")
 koxs.addEventListener("click",koxbenk)





}

}



function java() {
    k.play()
    var h = document.getElementsByClassName("hzor")
    document.body.removeChild(h[0])
var jav = document.createElement("div")
document.body.append(jav)
jav.setAttribute("class","jav")
var p1 = document.createElement("p")
jav.append(p1)
p1.setAttribute("class","javp1")
p1.innerHTML = "Game creator `Ashot Sargsyan:"

var p2 = document.createElement("p")
jav.append(p2)
p2.setAttribute("class","javp")
p2.innerHTML = "This game is written only javaScript:"



var p5 = document.createElement("p")
jav.append(p5)
p5.setAttribute("class","javp3")
p5.innerHTML = "Game create start date 06-18-2020:"



var p4 = document.createElement("p")
jav.append(p4)
p4.setAttribute("class","javp4")
p4.innerHTML = "Completion date 06-23-2020:"

var p3 = document.createElement("p")
jav.append(p3)
p3.setAttribute("class","javp2")
p3.innerHTML = "All rule protected:"


var heta = document.createElement("img")
heta.setAttribute("src","./img/het.png")
jav.append(heta)
heta.setAttribute("class","hetjav")
 heta.setAttribute("align","center")
heta.addEventListener("click",harcs)

}


harc[0].addEventListener("click",harcs)



 function xaxala() {
    k.play()
   
    
    a = 0

    function setups() {
        //     var timer = document.getElementById("timer")
     
         dong.play()
        function tameids() {
        
            dong.play()
if (a == 1) {
    clearInterval(ints)
    dong.pause()
}

        }
        var ints = setInterval(tameids, 100)
    }
    setups()

    





    document.body.removeChild(this)
document.body.removeChild(imgs[0])
document.body.removeChild(harc[0])
document.body.removeChild(durs[0])
document.body.removeChild(kox[0])
var bd = document.body
bd.style.backgroundImage = "url(./img/ground.jpg)"


var h1div = document.createElement("div")
h1div.setAttribute("class","h1")
document.body.append(h1div)
var h1div2 = document.createElement("div")
h1div2.setAttribute("class","menu")
h1div2.setAttribute("align","center")
h1div.append(h1div2)
var h1ner = document.createElement("h1")
h1ner.innerHTML = "Alias"
h1ner.setAttribute("align","center")
h1div2.append(h1ner)
var nkar = document.createElement("img")
nkar.setAttribute("class","home")
h1div2.append(nkar)
nkar.src = "./img/home.png"

var pouse = document.createElement("img")
h1div2.append(pouse)
pouse.setAttribute("class","pouse")
pouse.src = "./img/zvuk.png"

pouse.addEventListener("click",funkpouse)

xaxs = document.createElement("div")
document.body.append(xaxs)
xaxs.setAttribute("class","dasht")
// var h1 = document.getElementsByClassName("h1")
// h1[0].style.marginBottom = "160px"
// var enddivs = document.getElementsByClassName("endiv")
// xax[0].removeChild(enddivs[0])


var xax = document.getElementsByClassName("dasht")
var img = document.getElementsByClassName("home")
    img[0].onclick = function () {
        k.play()
    
    
    
        var t1 = document.getElementsByClassName("tim")
        var inp = document.getElementsByTagName("input")
        var bara = document.getElementsByClassName("barer")
        var jams = document.getElementsByTagName("p")
        var jams = document.getElementsByTagName("select")
        var kn = document.getElementById("gnume")
        var rejis = document.getElementsByClassName("rej")
        var qans = document.getElementsByClassName("qanis")
        var gncd = document.getElementsByClassName("gnacdiv")
        var eddivs = document.getElementsByClassName("endiv")
        var ddiv = document.getElementsByClassName("div")
        var javs = document.getElementsByClassName("jamanak")
        var gxl  = document.getElementsByClassName("dasht")
        var verev = document.getElementsByClassName("h1")

    if (!javs[0]) {
        
        if (qans[0]) {
            xax[0].removeChild(jams[0])
            xax[0].removeChild(kn)
            xax[0].removeChild(qans[0])
            xax[0].removeChild(rejis[0])
    
        }
    
        if (eddivs[0]) {
            xax[0].removeChild(eddivs[0])
        }
    
    
    
    
    
        if (gncd[0]) {
            xax[0].removeChild(gncd[0])
        }
    
    
        if (inp[0] && inp[3] && inp[4]) {
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
        }
    
        if (ddiv[0]) {
            xax[0].removeChild(ddiv[0])
        }
    
    
    
        if (inp[0] && inp[3] && !inp[4]) {
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
        }
        
        if (t1[0]) {
            xax[0].removeChild(t1[0])
            xax[0].removeChild(t1[0])
            xax[0].removeChild(t1[0])
        }
        if (inp[0] && !inp[3] && inp[1]) {
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
            xax[0].removeChild(inp[0])
        }
    
        if (!bara[0] && !jams[0]) {
            dong.pause()
            document.body.removeChild(xax[0])
          document.body.removeChild(verev[0])
           a=1
           var bd = document.body
           bd.style.backgroundColor = "black"
           bd.style.backgroundImage = "none"


           var imgner = document.createElement("img")
           document.body.append(imgner)
           imgner.src = "./img/bard.png"
           imgner.setAttribute("class","bask")
           
           
           
           var xaxanal = document.createElement("input")
           xaxanal.setAttribute("type","button")
           xaxanal.value = "Խաղալ"
           document.body.append(xaxanal)
           xaxanal.setAttribute("class","xaxal")
           xaxanal.setAttribute("align","center")
           
           
           
           var dursa = document.createElement("input")
           dursa.setAttribute("type","button")
           dursa.value = "Դուրս գալ"
           document.body.append(dursa)
           dursa.setAttribute("class","durs")
           dursa.setAttribute("align","center")
           dursa.addEventListener("click",durss)
           
           
           var harcak = document.createElement("img")
           harcak.setAttribute("src","./img/harc.png")
           document.body.append(harcak)
           harcak.setAttribute("class","harc")
           harcak.addEventListener("click",harcs)
           xaxanal.addEventListener("click",xaxala)

           var koxas = document.createElement("img")
           koxas.setAttribute("src","./img/kox.png")
           document.body.append(koxas)
           koxas.setAttribute("class","kox")
            koxas.addEventListener("click",koxbenk)
        



            
            // 
            // // bd.style.backgroundSize = "cover"
    
    
            // var h1 = document.getElementsByClassName("h1")
            // h1[0].style.marginBottom = "160px"
    
            // var xaxcs1 = document.createElement("input")
            // var xaxcs2 = document.createElement("input")
            // var xaxcs3 = document.createElement("input")
            // xax[0].append(xaxcs1, xaxcs2, xaxcs3)
            // xaxcs1.setAttribute("type", "button")
            // xaxcs2.setAttribute("type", "button")
            // xaxcs3.setAttribute("type", "button")
    
            // xaxcs1.setAttribute("value", "2 Թիմով")
            // xaxcs2.setAttribute("value", "3 Թիմով")
            // xaxcs3.setAttribute("value", "4 Թիմով")
    
    
    
            // xaxcs1.setAttribute("class", "xaxc1")
            // xaxcs2.setAttribute("class", "xaxc1")
            // xaxcs3.setAttribute("class", "xaxc1")
            // xaxcs1.addEventListener("click", timner)
            // xaxcs2.addEventListener("click", timner1)
            // xaxcs3.addEventListener("click", timner2)
    
    
        }
    
        mysuss = 0
        mysuss1 = 0
        mysuss2 = 0
        mysuss3 = 0
    
        verjmas1 = 0
        verjmas2 = 0
        verjmas3 = 0
        verjms3 = 0
        sxm = 0
        han = 0
        han1 = 0
        han2 = 0
        han3 = 0
        han4 = 0
        han5  = 0
        han6 = 0 //նավսյակի
        miavor = 0
        miavor2 = 0
        miavor3 = 0
        miavor4 = 0
        miyavorner = 0
        miyavorner2 = 0
        miyavorner3 = 0
        miyavorner4 = 0
        myuner = 0
        cl = 0
        verjms = 0
    
    
    }
    
       
    
    
     else if (javs[0]) {
            javs[0].style.color = "red"
            setTimeout(() => {
                javs[0].style.color = "black"
            }, 200);
          } 
    
    
    
    
    
     
            
           
         
              
          
    
    
    
    } 



var xaxcs1 = document.createElement("input")
var xaxcs2 = document.createElement("input")
var xaxcs3 = document.createElement("input")
xax[0].append(xaxcs1, xaxcs2, xaxcs3)
xaxcs1.setAttribute("type", "button")
xaxcs2.setAttribute("type", "button")
xaxcs3.setAttribute("type", "button")

xaxcs1.setAttribute("value", "2 Թիմով")
xaxcs2.setAttribute("value", "3 Թիմով")
xaxcs3.setAttribute("value", "4 Թիմով")



xaxcs1.setAttribute("class", "xaxc1")
xaxcs2.setAttribute("class", "xaxc1")
xaxcs3.setAttribute("class", "xaxc1")
xaxcs1.addEventListener("click", timner)
xaxcs2.addEventListener("click", timner1)
xaxcs3.addEventListener("click", timner2)

}



xaxal[0].addEventListener("click",xaxala)





function funkpouse() {
    k.play()
    if(a==0){  
        
    a=1
    dong.pause()
    this.src = "./img/bezzvuk.png"
    }
    else if (a==1) {
        this.src = "./img/zvuk.png"
        function setups() {
            //     var timer = document.getElementById("timer")
         
             dong.play()
            function tameids() {
            
                dong.play()
    if (a == 1) {
        clearInterval(ints)
        dong.pause()
    }
    
            }
            var ints = setInterval(tameids, 100)
        }
        setups()
        a=0  
    }
    
     



}










function random(params) {

    return params[Math.floor(Math.random() * params.length)]

}








function myus() {

    var bara = document.getElementsByClassName("barer")
    var jams = document.getElementsByTagName("p")


    if (bara[0]) {
        for (let c = 0; c < bara.length; c++) {
            xax[0].removeChild(bara[0])


        }


        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        xax[0].removeChild(jams[0])
        xax[0].removeChild(jams[0])
        xax[0].removeChild(jams[0])
    }

    sxm = 0
    han = 0
    han1 = 0
    han2 = 0
    han3 = 0
    han4 = 0
    han5 = 0
    han6 = 0
    if (miavor < hashiv && miavor2 < hashiv && miavor3 < hashiv && miyavorner4 < hashiv) {




        var newdiv = document.createElement("div")
        xax[0].append(newdiv)
        newdiv.setAttribute("class", "div")
        var p1 = document.createElement("p")
        newdiv.append(p1)
        p1.innerHTML = "Ժամանակը պրծավ"
        p1.style.color = "mediumvioletred"
        p1.setAttribute("class", "end")
        p1.setAttribute("align", "center")
        var hr = document.createElement("hr")
        newdiv.append(hr)
        var p2 = document.createElement("p")
        newdiv.append(p2)

        if (myuner == 0) {

             newdiv.style.marginTop = "102px"
            if (mysuss == 0) {

                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner + " միավոր"
                mysuss = 1
            }

            else if (mysuss == 1) {


                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner2 + " միավոր"
                mysuss = 0
            }




            p2.setAttribute("class", "end")
            p2.setAttribute("align", "center")

            var table = document.createElement("table")
            newdiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2



            var psnyer = document.createElement("p")
            newdiv.append(psnyer)
            psnyer.setAttribute("align", "center")
            psnyer.setAttribute("class", "divan")




            if (verjamas2 == 0) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim2
                verjamas2 = 1
            }

            else if (verjamas2 == 1) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim1
                verjamas2 = 0

            }

            var button = document.createElement("input")
            newdiv.append(button)
            button.style.marginTop = "0px"
            button.setAttribute("class", "knopka")
            button.setAttribute("type", "button")
            button.value = "Գնաց"

            if (verjms == 0) {

                button.addEventListener("click", game1)
                verjms = 1
            }

            else if (verjms == 1) {

                button.addEventListener("click", game)
                verjms = 0
            }



        }



        else if (myuner == 1) {


            newdiv.style.height = "560px"

            if (mysuss1 == 0) {



                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner + " միավոր"
                mysuss1 = 1
                naxmi = 0
            }
            else if (mysuss1 == 1) {

                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner2 + " միավոր"

                naxmi1 = 0
                mysuss1 = 2
            }




            else if (mysuss1 == 2) {

                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner3 + " միավոր"
                mysuss1 = 0

            }



            p2.setAttribute("class", "end")
            p2.setAttribute("align", "center")
            p2.style.marginTop = "30px"
            var table = document.createElement("table")
            newdiv.append(table)
            table.style.fontSize = "40px"
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2


            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3





            var psnyer = document.createElement("p")
            newdiv.append(psnyer)
            psnyer.setAttribute("align", "center")
            psnyer.setAttribute("class", "divan")




            if (verjmas1 == 0) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim2
                verjmas1 = 1
            }

            else if (verjmas1 == 1) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim3
                verjmas1 = 2

            }

            else if (verjmas1 == 2) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim1
                verjmas1 = 0

            }




            var button = document.createElement("input")
            newdiv.append(button)
            button.style.marginTop = "0px"
            button.setAttribute("class", "knopka")
            button.setAttribute("type", "button")
            button.value = "Գնաց"

            if (verjms == 0) {

                button.addEventListener("click", game1)
                verjms = 1
            }
            else if (verjms == 1) {;

                button.addEventListener("click", game2)
                verjms = 2
            }

            else if (verjms == 2) {

                button.addEventListener("click", game)
                verjms = 0
            }
        }

        else if (myuner == 2) {



            newdiv.style.height = "560px"
            if (mysuss3 == 0) {

                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner + " միավոր"
                mysuss3 = 1
            }
            else if (mysuss3 == 1) {

                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner2 + " միավոր"
                mysuss3 = 2
            }
            else if (mysuss3 == 2) {

                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner3 + " միավոր"
                mysuss3 = 3
            }
            else if (mysuss3 == 3) {

                p2.innerHTML = "Դուք վաստակեցիք " + miyavorner4 + " միավոր"
                mysuss3 = 0
            }



            p2.setAttribute("class", "end")
            p2.setAttribute("align", "center")

            var table = document.createElement("table")
            newdiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2


            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3

            var tr4 = document.createElement("tr")
            table.append(tr4)
            var td6 = document.createElement("td")
            var td7 = document.createElement("td")
            tr4.append(td6)
            tr4.append(td7)
            td6.textContent = tim4
            td7.textContent = miavor4






            var psnyer = document.createElement("p")
            newdiv.append(psnyer)
            psnyer.setAttribute("align", "center")
            psnyer.setAttribute("class", "divan")
            psnyer.style.marginTop = "20px"
            psnyer.style.marginBottom = "0px"

            if (verjmas3 == 0) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim2
                verjmas3 = 1
            }

            else if (verjmas3 == 1) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim3
                verjmas3 = 2

            }
            else if (verjmas3 == 2) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim4
                verjmas3 = 3

            }
            else if (verjmas3 == 3) {
                psnyer.innerHTML = "մյուս թիմը ՝" + tim1
                verjmas3 = 0
                console.log(verjmas3);

            }



            var button = document.createElement("input")
            newdiv.append(button)
            button.style.marginTop = "0px"
            button.setAttribute("class", "knopka")
            button.setAttribute("type", "button")
            button.value = "Գնաց"

            if (verjms3 == 0) {

                button.addEventListener("click", game1)
                verjms3 = 1
            }

            else if (verjms3 == 1) {

                button.addEventListener("click", game2)
                verjms3 = 2
            }
            else if (verjms3 == 2) {

                button.addEventListener("click", game3)
                verjms3 = 3
            }
            else if (verjms3 == 3) {

                button.addEventListener("click", game)
                verjms3 = 0
            }



        }



    }


    else if (miavor >= hashiv) {

    ends.play()
        verjmas3 = 0
        mysuss3 = 0
        verjms3 = 0
        verjmas2 = 0
        mysuss = 0
        mysuss1 = 0
        mysuss2 = 0
        mysuss3 = 0
        verjms = 0
        verjmas1 = 0
        var bd = document.body
        bd.style.background = "seagreen"
        var enddiv = document.createElement("div")
        xax[0].append(enddiv)
        enddiv.setAttribute("class", "endiv")
        var ps = document.createElement("p")
        enddiv.append(ps)
        ps.innerHTML = "Շնորհավոր !!"
        ps.setAttribute("class", "ends")
        var p = document.createElement("p")
        p.innerHTML = "Հաղթեց ՝" + tim1 + "ը"
        p.setAttribute("align", "center")
        p.setAttribute("class", "ends1")
        enddiv.append(p)
        if (myuner == 0) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2



            var button = document.createElement("input")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.setAttribute("type", "button")
            button.addEventListener("click", create)
        }

        else if (myuner == 1) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2

            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3


            var button = document.createElement("input")
            button.setAttribute("type", "button")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.style.marginTop = "50px"
            button.addEventListener("click", create)



        }

        else if (myuner == 2) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2


            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3

            var tr4 = document.createElement("tr")
            table.append(tr4)
            var td6 = document.createElement("td")
            var td7 = document.createElement("td")
            tr4.append(td6)
            tr4.append(td7)
            td6.textContent = tim4
            td7.textContent = miavor4


            var button = document.createElement("input")
            button.setAttribute("type", "button")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.style.marginTop = "0px"
            button.addEventListener("click", create)


        }

    }
    else if (miavor2 >= hashiv) {


        ends.play()
        verjmas3 = 0
        mysuss3 = 0
        verjms3 = 0
        verjmas2 = 0
        verjmas1 = 0
        mysuss = 0
        mysuss1 = 0
        mysuss2 = 0
        mysuss3 = 0
        verjms = 0
        var bd = document.body
        bd.style.background = "seagreen"
        var enddiv = document.createElement("div")
        xax[0].append(enddiv)
        enddiv.setAttribute("class", "endiv")
        var ps = document.createElement("p")
        ps.innerHTML = "Շնորհավոր"
        ps.setAttribute("class", "ends")
        enddiv.append(ps)
        var p = document.createElement("p")
        p.innerHTML = "Հաղթեց ՝" + tim2 + 'ը'
        p.setAttribute("class", "ends1")
        p.setAttribute("align", "center")
        enddiv.append(p)

        if (myuner == 0) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2



            var button = document.createElement("input")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.setAttribute("type", "button")
            button.addEventListener("click", create)
        }

        else if (myuner == 1) {
            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2

            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3


            var button = document.createElement("input")
            button.setAttribute("type", "button")
         
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.style.marginTop = "50px"
            button.addEventListener("click", create)



        }

        else if (myuner == 2) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2


            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3

            var tr4 = document.createElement("tr")
            table.append(tr4)
            var td6 = document.createElement("td")
            var td7 = document.createElement("td")
            tr4.append(td6)
            tr4.append(td7)
            td6.textContent = tim4
            td7.textContent = miavor4


            var button = document.createElement("input")
            button.setAttribute("type", "button")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.style.marginTop = "0px"
            button.addEventListener("click", create)


        }






    }
    else if (miavor3 >= hashiv) {

        ends.play()
        mysuss = 0
        mysuss1 = 0
        mysuss2 = 0
        mysuss3 = 0
        verjms = 0
        verjmas1 = 0
        verjmas2 = 0
        verjmas3 = 0
        mysuss3 = 0
        verjms3 = 0
        verjmas2 = 0
        var bd = document.body
        bd.style.background = "seagreen"
        var enddiv = document.createElement("div")
        xax[0].append(enddiv)
        enddiv.setAttribute("class", "endiv")
        var ps = document.createElement("p")
        ps.innerHTML = "Շնորհավոր"
        ps.setAttribute("class", "ends")
        enddiv.append(ps)
        var p = document.createElement("p")
        p.innerHTML = "Հաղթեց ՝" + tim3 + 'ը'
        p.setAttribute("class", "ends1")
        p.setAttribute("align", "center")
        enddiv.append(p)

        if (myuner == 0) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2



            var button = document.createElement("input")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.setAttribute("type", "button")
            button.addEventListener("click", create)
        }

        else if (myuner == 1) {


            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2

            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3

            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3



            var button = document.createElement("input")
            button.setAttribute("type", "button")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.style.marginTop = "50px"
            button.addEventListener("click", create)



        }

        else if (myuner == 2) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2


            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3

            var tr4 = document.createElement("tr")
            table.append(tr4)
            var td6 = document.createElement("td")
            var td7 = document.createElement("td")
            tr4.append(td6)
            tr4.append(td7)
            td6.textContent = tim4
            td7.textContent = miavor4


            var button = document.createElement("input")
            button.setAttribute("type", "button")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.style.marginTop = "0px"
            button.addEventListener("click", create)


        }







    }

    else if (miavor4 >= hashiv) {

        ends.play()
        mysuss = 0
        mysuss1 = 0
        mysuss2 = 0
        mysuss3 = 0
        verjms = 0
        verjmas1 = 0
        verjmas2 = 0
        verjmas3 = 0
        mysuss3 = 0
        verjms3 = 0
        verjmas2 = 0
        var bd = document.body
        bd.style.background = "seagreen"
        var enddiv = document.createElement("div")
        xax[0].append(enddiv)
        enddiv.setAttribute("class", "endiv")
        var ps = document.createElement("p")
        ps.innerHTML = "Շնորհավոր"
        ps.setAttribute("class", "ends")
        enddiv.append(ps)
        var p = document.createElement("p")
        p.innerHTML = "Հաղթեց ՝" + tim4 + 'ը'
        p.setAttribute("class", "ends1")
        p.setAttribute("align", "center")
        enddiv.append(p)
        if (myuner == 0) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2



            var button = document.createElement("input")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.setAttribute("type", "button")
            button.addEventListener("click", create)
        }

        else if (myuner == 1) {
            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2

            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3

            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3



            var button = document.createElement("input")
            button.setAttribute("type", "button")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.addEventListener("click", create)



        }

        else if (myuner == 2) {

            var table = document.createElement("table")
            enddiv.append(table)
            var tr = document.createElement("tr")
            table.append(tr)
            var td = document.createElement("td")
            var td1 = document.createElement("td")
            tr.append(td)
            tr.append(td1)
            td.textContent = tim1
            td1.textContent = miavor

            var tr2 = document.createElement("tr")
            table.append(tr2)
            var td2 = document.createElement("td")
            var td3 = document.createElement("td")
            tr2.append(td2)
            tr2.append(td3)
            td2.textContent = tim2
            td3.textContent = miavor2


            var tr3 = document.createElement("tr")
            table.append(tr3)
            var td4 = document.createElement("td")
            var td5 = document.createElement("td")
            tr3.append(td4)
            tr3.append(td5)
            td4.textContent = tim3
            td5.textContent = miavor3

            var tr4 = document.createElement("tr")
            table.append(tr4)
            var td6 = document.createElement("td")
            var td7 = document.createElement("td")
            tr4.append(td6)
            tr4.append(td7)
            td6.textContent = tim4
            td7.textContent = miavor4


            var button = document.createElement("input")
            button.setAttribute("type", "button")
            enddiv.append(button)
            button.setAttribute("class", "endbut")
            button.style.marginTop = "0px"
            button.addEventListener("click", create)


        }







    }



    var dnv = document.createElement("p")
    miyavorner = 0
    miyavorner2 = 0
    miyavorner3 = 0
    miyavorner4 = 0

}




function create() {
    k.play()
    mysuss = 0
    mysuss1 = 0
    mysuss2 = 0
    mysuss3 = 0
    verjmas1 = 0
    verjmas2 = 0
    verjmas3 = 0
    verjms3 = 0
    verjmas2 = 0

  sxm = 0
    han = 0
    han1 = 0
    han2 = 0
    han3 = 0
    han4 = 0
    han5 = 0
    han6 = 0
    miavor = 0
    miavor2 = 0
    miavor3 = 0
    miavor4 = 0



    miyavorner = 0
    miyavorner2 = 0
    miyavorner3 = 0
    miyavorner4 = 0

    myuner = 0



    cl = 0
    verjms = 0

    var bd = document.body

    bd.style.backgroundImage = "url(./img/ground.jpg)"

    var h1 = document.getElementsByClassName("h1")
    h1[0].style.marginBottom = "160px"
    var enddivs = document.getElementsByClassName("endiv")
    xax[0].removeChild(enddivs[0])

    var xaxcs1 = document.createElement("input")
    var xaxcs2 = document.createElement("input")
    var xaxcs3 = document.createElement("input")
    xax[0].append(xaxcs1, xaxcs2, xaxcs3)
    xaxcs1.setAttribute("type", "button")
    xaxcs2.setAttribute("type", "button")
    xaxcs3.setAttribute("type", "button")

    xaxcs1.setAttribute("value", "2 Թիմով")
    xaxcs2.setAttribute("value", "3 Թիմով")
    xaxcs3.setAttribute("value", "4 Թիմով")



    xaxcs1.setAttribute("class", "xaxc1")
    xaxcs2.setAttribute("class", "xaxc1")
    xaxcs3.setAttribute("class", "xaxc1")
    xaxcs1.addEventListener("click", timner)
    xaxcs2.addEventListener("click", timner1)
    xaxcs3.addEventListener("click", timner2)
}












function timner() {
    myuner = 0
 
   
   
    k.play()
    for (let i = 0; i < inp.length; i++) {
        xax[0].removeChild(inp[0])

    }
    xax[0].removeChild(inp[0])

    tims()
}

function timner1() {
    myuner = 1
    k.play()
    for (let i = 0; i < inp.length; i++) {
        xax[0].removeChild(inp[0])

    }
    xax[0].removeChild(inp[0])

    tims1()
}

function timner2() {
    myuner = 2
    k.play()
    for (let i = 0; i < inp.length; i++) {
        xax[0].removeChild(inp[0])

    }
    xax[0].removeChild(inp[0])

    tims2()
}

function tims2() {

    var hs = document.getElementsByClassName("h1")
    hs[0].style.marginBottom = "150px"

    var xaxc1 = document.createElement("input")
    xaxc1.setAttribute("class", "xaxc1")
    xaxc1.setAttribute("type", "text")
    xax[0].append(xaxc1)
    xaxc1.setAttribute("placeholder", "Թիմ 1-ի անունը")

    var xaxc2 = document.createElement("input")
    xaxc2.setAttribute("class", "xaxc1")
    xaxc2.setAttribute("type", "text")
    xax[0].append(xaxc2)
    xaxc2.setAttribute("placeholder", "Թիմ 2-ի անունը")




    var xaxc3 = document.createElement("input")
    xaxc3.setAttribute("class", "xaxc1")
    xaxc3.setAttribute("type", "text")
    xax[0].append(xaxc3)
    xaxc3.setAttribute("placeholder", "Թիմ 3-ի անունը")


    var xaxc4 = document.createElement("input")
    xaxc4.setAttribute("class", "xaxc1")
    xaxc4.setAttribute("type", "text")
    xax[0].append(xaxc4)
    xaxc4.setAttribute("placeholder", "Թիմ 4-ի անունը")



    var knopka = document.createElement("input")
    knopka.setAttribute("type", "button")
    knopka.setAttribute("value", "Գնաց")
    knopka.setAttribute("class", "knopka")
    knopka.style.marginTop = "10px"
    knopka.setAttribute("id", "gnac")
    xax[0].appendChild(knopka)
    knopka.addEventListener("click", gnac2)


}








//+
function tims1(params) {



    var hs = document.getElementsByClassName("h1")
    hs[0].style.marginBottom = "150px"

    var xaxc1 = document.createElement("input")
    xaxc1.setAttribute("class", "xaxc1")
    xaxc1.setAttribute("type", "text")
    xax[0].append(xaxc1)
    xaxc1.setAttribute("placeholder", "Թիմ 1-ի անունը")

    var xaxc2 = document.createElement("input")
    xaxc2.setAttribute("class", "xaxc1")
    xaxc2.setAttribute("type", "text")
    xax[0].append(xaxc2)
    xaxc2.setAttribute("placeholder", "Թիմ 2-ի անունը")




    var xaxc3 = document.createElement("input")
    xaxc3.setAttribute("class", "xaxc1")
    xaxc3.setAttribute("type", "text")
    xax[0].append(xaxc3)
    xaxc3.setAttribute("placeholder", "Թիմ 3-ի անունը")


    var knopka = document.createElement("input")
    knopka.setAttribute("type", "button")
    knopka.setAttribute("value", "Գնաց")
    knopka.setAttribute("class", "knopka")
    knopka.setAttribute("id", "gnac")
    xax[0].appendChild(knopka)
    knopka.addEventListener("click", gnac1)


}





function tims() {


    var xaxc1 = document.createElement("input")
    xaxc1.setAttribute("class", "xaxc1")
    xaxc1.setAttribute("type", "text")
    xax[0].append(xaxc1)
    xaxc1.setAttribute("placeholder", "Թիմ 1-ի անունը")

    var xaxc2 = document.createElement("input")
    xaxc2.setAttribute("class", "xaxc1")
    xaxc2.setAttribute("type", "text")
    xax[0].append(xaxc2)
    xaxc2.setAttribute("placeholder", "Թիմ 2-ի անունը")

    var knopka = document.createElement("input")
    knopka.setAttribute("type", "button")
    knopka.setAttribute("value", "Գնաց")
    knopka.setAttribute("class", "knopka")
    knopka.setAttribute("id", "gnac")
    xax[0].appendChild(knopka)
    knopka.addEventListener("click", gnac)


}

function gnac() {
    var xaxc1 = document.getElementsByClassName("xaxc1")
    k.play()

    if (xaxc1[0].value != "" && xaxc1[1].value != "") {
        tim1 = xaxc1[0].value
        tim2 = xaxc1[1].value





        for (let i = 0; i < xaxc1.length; i++) {
            xax[0].removeChild(xaxc1[0])

        }
        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(this)



        var hms = document.getElementsByClassName("h1")
        hms[0].style.marginBottom = "110px"
        var jam = document.createElement("select")
        xax[0].appendChild(jam)
        var ops = document.createElement("option")
        jam.append(ops)
        ops.textContent = "Ժամանակը"
        for (let s = 30; s <= 90; s += 10) {
            var op = document.createElement("option")
            op.textContent = s
            jam.appendChild(op)

        }


        var qanis = document.createElement("select")
        var qnass = document.createElement("option")
        xax[0].append(qanis)
        qanis.append(qnass)
        qanis.setAttribute("class", "qanis")
        qnass.textContent = "Քանիսի՞ց"
        for (let l = 50; l <= 100; l += 25) {
            var opss = document.createElement("option")
            opss.textContent = l
            qanis.appendChild(opss)

        }
        var rej = document.createElement("select")
        rej.setAttribute("class", "rej")
        xax[0].appendChild(rej)
        var rejs = document.createElement("option")
        rej.append(rejs)
        rejs.textContent = "Ռեժիմ"
        var rejs3 = document.createElement("option")
        rej.append(rejs3)
        rejs3.textContent = "Սովորական"

        var rejs2 = document.createElement("option")
        rej.append(rejs2)
        rejs2.textContent = "Օբեկտի խաղ"


        var rejs3 = document.createElement("option")
        rej.append(rejs3)
        rejs3.textContent = "Խառը"
     
       if (exav==1) {      
        var rejs4 = document.createElement("option")
        rej.append(rejs4)
        rejs4.textContent = im
  
       }



        var h1 = document.getElementsByTagName("h1")
        h1[0].style.marginBottom = "100px"
        var gnume = document.createElement("input")
        gnume.setAttribute("type", "button")
        gnume.setAttribute("value", "Գնաց")
        gnume.setAttribute("class", "knopka")
        gnume.setAttribute("id", "gnume")
        xax[0].appendChild(gnume)
        gnume.addEventListener("click", sksvav)





    }


}
//var gnac = document.getElementById("gnac")

// 3 թիմովի մար
function gnac1() {
    var xaxc1 = document.getElementsByClassName("xaxc1")
    k.play()
    if (xaxc1[0].value != "" && xaxc1[1].value != "" && xaxc1[2].value != "") {
        tim1 = xaxc1[0].value
        tim2 = xaxc1[1].value
        tim3 = xaxc1[2].value

        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(this)







        var jam = document.createElement("select")
        xax[0].appendChild(jam)
        var ops = document.createElement("option")
        jam.append(ops)
        var hms = document.getElementsByClassName("h1")
        hms[0].style.marginBottom = "110px"
        ops.textContent = "Ժամանակը"
        for (let s = 30; s <= 90; s += 10) {
            var op = document.createElement("option")
            op.textContent = s
            jam.appendChild(op)

        }


        var qanis = document.createElement("select")
        var qnass = document.createElement("option")
        xax[0].append(qanis)
        qanis.append(qnass)
        qanis.setAttribute("class", "qanis")
        qnass.textContent = "Քանիսի՞ց"
        for (let l = 50; l <= 100; l += 25) {
            var opss = document.createElement("option")
            opss.textContent = l
            qanis.appendChild(opss)

        }
        var rej = document.createElement("select")
        rej.setAttribute("class", "rej")
        xax[0].appendChild(rej)
        var rejs = document.createElement("option")
        rej.append(rejs)
        rejs.textContent = "Ռեժիմ"
        var rejs3 = document.createElement("option")
        rej.append(rejs3)
        rejs3.textContent = "Սովորական"

        var rejs2 = document.createElement("option")
        rej.append(rejs2)
        rejs2.textContent = "Օբեկտի խաղ"

   var rejs3 = document.createElement("option")
        rej.append(rejs3)
        rejs3.textContent = "Խառը"

        if (exav==1) {      
            var rejs4 = document.createElement("option")
            rej.append(rejs4)
            rejs4.textContent = im
      
           }


        var h1 = document.getElementsByTagName("h1")
        h1[0].style.marginBottom = "100px"
        var gnume = document.createElement("input")
        gnume.setAttribute("type", "button")
        gnume.setAttribute("value", "Գնաց")
        gnume.setAttribute("class", "knopka")
        gnume.setAttribute("id", "gnume")
        xax[0].appendChild(gnume)
        gnume.addEventListener("click", sksvav)





    }



}

function gnac2() {
    var xaxc1 = document.getElementsByClassName("xaxc1")
    k.play()
    if (xaxc1[0].value != "" && xaxc1[1].value != "" && xaxc1[2].value != "" && xaxc1[3].value != "") {
        tim1 = xaxc1[0].value
        tim2 = xaxc1[1].value
        tim3 = xaxc1[2].value
        tim4 = xaxc1[3].value
        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(xaxc1[0])
        xax[0].removeChild(this)





        var hms = document.getElementsByClassName("h1")
        hms[0].style.marginBottom = "110px"

        var jam = document.createElement("select")
        xax[0].appendChild(jam)
        var ops = document.createElement("option")
        jam.append(ops)
        ops.textContent = "Ժամանակը"
        for (let s = 30; s <= 90; s += 10) {
            var op = document.createElement("option")
            op.textContent = s
            jam.appendChild(op)

        }


        var qanis = document.createElement("select")
        var qnass = document.createElement("option")
        xax[0].append(qanis)
        qanis.append(qnass)
        qanis.setAttribute("class", "qanis")
        qnass.textContent = "Քանիսի՞ց"
        for (let l = 50; l <= 100; l += 25) {
            var opss = document.createElement("option")
            opss.textContent = l
            qanis.appendChild(opss)

        }
        var rej = document.createElement("select")
        rej.setAttribute("class", "rej")
        xax[0].appendChild(rej)
        var rejs = document.createElement("option")
        rej.append(rejs)
        rejs.textContent = "Ռեժիմ"
        var rejs3 = document.createElement("option")
        rej.append(rejs3)
        rejs3.textContent = "Սովորական"

        var rejs2 = document.createElement("option")
        rej.append(rejs2)
        rejs2.textContent = "Օբեկտի խաղ"

        var rejs3 = document.createElement("option")
        rej.append(rejs3)
        rejs3.textContent = "Խառը"


        if (exav==1) {      
            var rejs4 = document.createElement("option")
            rej.append(rejs4)
            rejs4.textContent = im
      
           }


        var h1 = document.getElementsByTagName("h1")
        h1[0].style.marginBottom = "100px"
        var gnume = document.createElement("input")
        gnume.setAttribute("type", "button")
        gnume.setAttribute("value", "Գնաց")
        gnume.setAttribute("class", "knopka")
        gnume.setAttribute("id", "gnume")
        xax[0].appendChild(gnume)
        gnume.addEventListener("click", sksvav)





    }


}







function sksvav() {
    k.play()
    var jams = document.getElementsByTagName("select")
    var kn = document.getElementById("gnume")
    var rejis = document.getElementsByClassName("rej")
    var qans = document.getElementsByClassName("qanis")
    if (qans[0].value != "Քանիսի՞ց" && jams[0].value != "Ժամանակը" && rejis[0].value != "Ռեժիմ") {
        jamanak = jams[0].value

        hashiv = qans[0].value
        rejim = rejis[0].value
        xax[0].removeChild(jams[0])
        xax[0].removeChild(kn)
        xax[0].removeChild(qans[0])
        xax[0].removeChild(rejis[0])
        //ես մասը կիսատա
        var h1s = document.getElementsByClassName("h1")
        h1s[0].style.marginBottom = "100px"
        var gnacdiv = document.createElement("div")
        gnacdiv.setAttribute("class", "gnacdiv")
        xax[0].append(gnacdiv)


        var jamsn = document.createElement("p")
        gnacdiv.append(jamsn)
        jamsn.setAttribute("class", "jamsn")
        jamsn.innerHTML = "ժամանկը " + jamanak + "-վ"
        jamsn.setAttribute("align", "center")



    


        var minch = document.createElement("p")
        gnacdiv.append(minch)
        minch.setAttribute("class", "minch")
        minch.innerHTML = "հաշիվը մինչև " + hashiv + "-ը"
        minch.setAttribute("align", "center")


        var rjs = document.createElement("p")
        gnacdiv.append(rjs)
        rjs.setAttribute("class", "rejs")
        rjs.innerHTML = "Ռեժիմը ՝"+rejim
        rjs.setAttribute("align", "center")



        var tims1 = document.createElement("p")
        gnacdiv.append(tims1)
        tims1.setAttribute("class", "tims1")
        tims1.innerHTML = "Թիմ 1 " + tim1
        tims1.setAttribute("align", "center")






        var gnumem = document.createElement("input")
        gnumem.setAttribute("type", "button")
        gnumem.setAttribute("value", "Գնաց")
        gnumem.setAttribute("class", "knopka")
        gnumem.style.marginTop = "2px"
        gnumem.setAttribute("id", "gnumem")
        gnacdiv.appendChild(gnumem)
        gnumem.addEventListener("click", game)



    }




    else if (qans[0].value == "Քանիսի՞ց" && jams[0].value == "Ժամանակը" && rejis[0].value == "Ռեժիմ") {
        qans[0].style.color = "red"
        jams[0].style.color = "red"
        rejis[0].style.color = "red"
        setTimeout(() => {
            qans[0].style.color = "white"
            jams[0].style.color = "white"
            rejis[0].style.color = "white"
        }, 200);

    }

    else if (qans[0].value == "Քանիսի՞ց" && jams[0].value == "Ժամանակը" && rejis[0].value != "Ռեժիմ") {

        jams[0].style.color = "red"
        qans[0].style.color = "red"
        setTimeout(() => {
            jams[0].style.color = "white"
            qans[0].style.color = "white"
        }, 200);

    }



    else if (qans[0].value != "Քանիսի՞ց" && jams[0].value == "Ժամանակը" && rejis[0].value == "Ռեժիմ") {
        jams[0].style.color = "red"
        rejis[0].style.color = "red"
        setTimeout(() => {
            jams[0].style.color = "white"
            rejis[0].style.color = "white"
        }, 200);

    }


    else if (qans[0].value == "Քանիսի՞ց" && jams[0].value != "Ժամանակը" && rejis[0].value == "Ռեժիմ") {
        qans[0].style.color = "red"
        rejis[0].style.color = "red"
        setTimeout(() => {
            qans[0].style.color = "white"
            rejis[0].style.color = "white"
        }, 200);

    }







    else if (qans[0].value == "Քանիսի՞ց") {
        qans[0].style.color = "red"
        setTimeout(() => {
            qans[0].style.color = "white"
        }, 200);

    }
    else if (jams[0].value == "Ժամանակը") {
        jams[0].style.color = "red"
        setTimeout(() => {
            jams[0].style.color = "white"
        }, 200);

    }
    else if (rejis[0].value == "Ռեժիմ") {
        rejis[0].style.color = "red"
        setTimeout(() => {
            rejis[0].style.color = "white"
        }, 200);

    }




}



function game1() {
    var divs = document.getElementsByClassName("div")

    xax[0].removeChild(divs[0])
    sxm = 0
    han = 0
    han1 = 0
    han2 = 0
    han3 = 0
    han4 = 0
    cl = 0

    var time = parseInt(jamanak)
    var cond = 0;
    var h1 = document.getElementsByClassName("h1")
    h1[0].style.marginBottom = "50px"


    var gamer1 = document.createElement("p")
    xax[0].append(gamer1)
    gamer1.setAttribute("class", "gamer1")
    gamer1.setAttribute("align", "center")

    gamer1.innerHTML = tim2



    var miav = document.createElement("p")
    xax[0].append(miav)
    miav.innerHTML = "միավոր:0"
    miav.setAttribute("class", "miavor")
    var timer = document.createElement("p")
    xax[0].append(timer)
    timer.setAttribute("class", "jamanak")


    // function varkyan(s) {
    //     // var min = Math.floor(s/60)
    //     var sec = s % 60
    //     return sec
    // }

    function setup() {
        //     var timer = document.getElementById("timer")
        timer.innerHTML = "ժամանակը:" + (time - cond)
        audioLA.play()
        function tameid() {
            cond++
            timer.innerHTML = "ժամանակը:" + (time - cond)
            audioLA.play()

            if (cond == time) {
                cond = 0
                bud.play()
                clearInterval(int)
                setTimeout(() => {
                    myus()
                }, 1400);



            }
        }
        var int = setInterval(tameid, 1000)
    }
    setup()

    if (rejim == "Օբեկտի խաղ") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barer)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin1)


        }
    }

    else if (rejim == "Սովորական") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barers)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin1)


        }
    }
    else if (rejim == "Խառը") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(xar)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin1)


        }
    }
    else if (rejim == im) {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(sepakan)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin1)


        }
    }
}




function xaxayin1() {
    var miav = document.getElementsByClassName("miavor")
    gss.play()



    if (this.id == 0) {


        if (sxm == 0) {
            cl++
            miavor2++
            miyavorner2++
            sxm = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (sxm == 1) {
            miavor2--
            miyavorner2--
            sxm = 0
            cl--
            this.style.backgroundColor = "black"


        }


    }
    else if (this.id == 1) {


        if (han == 0) {
            miavor2++
            miyavorner2++
            cl++
            han = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han == 1) {
            cl--
            miavor2--
            miyavorner2--
            han = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 2) {



        if (han1 == 0) {
            miavor2++
            cl++
            miyavorner2++
            han1 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han1 == 1) {
            miavor2--
            miyavorner2++
            cl--
            han1 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 3) {



        if (han2 == 0) {
            miavor2++
            miyavorner2++
            cl++
            han2 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han2 == 1) {
            miavor2--
            miyavorner2--
            cl--
            han2 = 0
            this.style.backgroundColor = "black"


        }

    }
    else if (this.id == 4) {



        if (han3 == 0) {
            cl++
            miavor2++
            miyavorner2++
            han3 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han3 == 1) {
            cl--
            miavor2--
            miyavorner2--
            han3 = 0
            this.style.backgroundColor = "black"


        }

    }
     
    else if (this.id == 5) {



        if (han4 == 0) {
            cl++
            miavor2++
            miyavorner2++
            han4= 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han4 == 1) {
            cl--
            miavor2--
            miyavorner2--
            han4 = 0
            this.style.backgroundColor = "black"


        }

    }



    miav[0].innerHTML = "միավոր:" + miyavorner2
    if (cl == qanak) {
        //  var bar =document.getElementsByClassName("bar")
        post.play()
        var bara = document.getElementsByClassName("barer")
        for (let c = 0; c < bara.length; c++) {
            xax[0].removeChild(bara[0])


        }

        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])



        if (rejim == "Օբեկտի խաղ") {


            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barer)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin1)


            }
        }

        else if (rejim == "Սովորական") {


            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barers)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin1)


            }
        }
        else if (rejim == "Խառը") {


            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(xar)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin1)


            }
        }
        else if (rejim == im) {

            for (let l = 0; l < qanak; l++) {
    
                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(sepakan)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin1)
    
    
            }
        }



        sxm = 0
        han = 0
        han1 = 0
        han2 = 0
        han3 = 0
        han4 = 0
        cl = 0
    }












}

function game3() {
    k.play()
    var divs = document.getElementsByClassName("div")
    var kn = document.getElementsByClassName("gnacdiv")
    if (kn[0]) {
        xax[0].removeChild(kn[0])


    }

    if (divs[0]) {
        xax[0].removeChild(divs[0])
      

    }
    sxm = 0
    han = 0
    han1 = 0
    han2 = 0
    han3 = 0
    cl = 0


    var time = parseInt(jamanak)
    // var time = 3
    var cond = 0;
    var h1 = document.getElementsByClassName("h1")
    h1[0].style.marginBottom = "20px"


    var gamer1 = document.createElement("p")
    xax[0].append(gamer1)
    gamer1.setAttribute("class", "gamer1")
    gamer1.setAttribute("align", "center")

    gamer1.innerHTML = tim4


    var miav = document.createElement("p")
    xax[0].append(miav)
    miav.innerHTML = "միավոր:0"
    miav.setAttribute("class", "miavor")
    var timer = document.createElement("p")
    xax[0].append(timer)
    timer.setAttribute("class", "jamanak")


    // function varkyan(s) {
    //     // var min = Math.floor(s/60)
    //     var sec = s % 60
    //     return sec
    // }

    function setup() {
        //     var timer = document.getElementById("timer")
        timer.innerHTML = "ժամանակը:" + (time - cond)
        audioLA.play();

        function tameid() {
            cond++
            timer.innerHTML = "ժամանակը:" + (time - cond)
            audioLA.play();

            if (cond == time) {
                cond = 0
                bud.play()
                clearInterval(int)
                setTimeout(() => {
                    myus()
                }, 1400);



            }
        }
        var int = setInterval(tameid, 1000)
    }
    setup()

    if (rejim == "Օբեկտի խաղ") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barer)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin3)


        }
    }

    else if (rejim == "Սովորական") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barers)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin3)


        }
    }

    else if (rejim == "Խառը") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(xar)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin3)


        }
    }
    else if (rejim == im) {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(sepakan)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin3)


        }
    }

}





function game() {
    var divs = document.getElementsByClassName("div")
    k.play()
    var kn = document.getElementsByClassName("gnacdiv")
    if (kn[0]) {
        xax[0].removeChild(kn[0])
    }

    if (divs[0]) {


        xax[0].removeChild(divs[0])
 

    }

    sxm = 0
    han = 0
    han1 = 0
    han2 = 0
    han3 = 0
    han4 = 0
    cl = 0

    var time = parseInt(jamanak)
    // var time = 3
    var cond = 0;
    var h1 = document.getElementsByClassName("h1")
    h1[0].style.marginBottom = "50px"




    var gamer1 = document.createElement("p")
    xax[0].append(gamer1)
    gamer1.setAttribute("class", "gamer1")
    gamer1.setAttribute("align", "center")

    gamer1.innerHTML = tim1




    var miav = document.createElement("p")
    xax[0].append(miav)
    miav.innerHTML = "միավոր:0"
    miav.setAttribute("class", "miavor")

    var timer = document.createElement("p")
    xax[0].append(timer)
    timer.setAttribute("class", "jamanak")




    function setup() {
        //     var timer = document.getElementById("timer")
        timer.innerHTML = "ժամանակը:" + (time - cond)
        audioLA.play();
        function tameid() {
            cond++
            audioLA.play();

            timer.innerHTML = "ժամանակը:" + (time - cond)


            if (cond == time) {
                cond = 0



                bud.play()
                clearInterval(int)
                setTimeout(() => {
                    myus()
                }, 1400);




            }
        }
        var int = setInterval(tameid, 1000)
    }
    setup()

    if (rejim == "Օբեկտի խաղ") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barer)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin)


        }
    }

    else if (rejim == "Սովորական") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barers)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin)


        }
    }

    else if (rejim == "Խառը") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(xar)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin)


        }
    }

    else if (rejim == im) {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(sepakan)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin)


        }
    }




}



function xaxayin() {
    var miav = document.getElementsByClassName("miavor")
    gss.play()


    if (this.id == 0) {


        if (sxm == 0) {
            cl++
            miavor++
            miyavorner++
            sxm = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (sxm == 1) {
            miavor--
            miyavorner--
            sxm = 0
            cl--
            this.style.backgroundColor = "black"


        }


    }
    else if (this.id == 1) {


        if (han == 0) {
            miavor++
            miyavorner++
            cl++
            han = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han == 1) {
            cl--
            miavor--
            miyavorner--
            han = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 2) {



        if (han1 == 0) {
            miavor++
            cl++
            miyavorner++
            han1 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han1 == 1) {
            miavor--
            cl--
            miyavorner--
            han1 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 3) {



        if (han2 == 0) {
            miavor++
            cl++
            miyavorner++
            han2 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han2 == 1) {
            miavor--
            cl--
            miyavorner--
            han2 = 0
            this.style.backgroundColor = "black"


        }

    }
    else if (this.id == 4) {



        if (han3 == 0) {
            cl++
            miavor++
            miyavorner++
            han3 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han3 == 1) {
            cl--
            miavor--
            miyavorner--
            han3 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 5) {

        if (han4 == 0) {
            cl++
            miavor++
            miyavorner++
            han4 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han4 == 1) {
            cl--
            miavor--
            miyavorner--
            han4 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 6) {

        if (han5 == 0) {
            cl++
            miavor++
            miyavorner++
            han5 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han5 == 1) {
            cl--
            miavor--
            miyavorner--
            han5 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 7) {

        if (han6 == 0) {
            cl++
            miavor++
            miyavorner++
            han6 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han6 == 1) {
            cl--
            miavor--
            miyavorner--
            han6 = 0
            this.style.backgroundColor = "black"


        }

    }







    miav[0].innerHTML = "միավոր:" + miyavorner
    if (cl == qanak) {
        //  var bar =document.getElementsByClassName("bar")
        post.play()
        var bara = document.getElementsByClassName("barer")
        for (let c = 0; c < bara.length; c++) {
            xax[0].removeChild(bara[0])


        }
        //var gams = document.getElementsByClassName("gamer1")
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        //xax[0].removeChild(gams[0])




        if (rejim == "Օբեկտի խաղ") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barer)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin)


            }
        }

        else if (rejim == "Սովորական") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barers)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin)


            }
        }


        else if (rejim == "Խառը") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(xar)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin)


            }
        }
        else if (rejim == im) {

            for (let l = 0; l < qanak; l++) {
    
                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(sepakan)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin)
    
    
            }
        }



        // var gamer1 = document.createElement("p")
        // xax[0].append(gamer1)
        // gamer1.setAttribute("class", "gamer1")
        // gamer1.setAttribute("align", "center")

        // gamer1.innerHTML = tim1

        sxm = 0
        han = 0
        han1 = 0
        han2 = 0
        han3 = 0
        han4 = 0
        han5 = 0
        han6 = 0
        cl = 0
    }





}

function xaxayin2() {
    var miav = document.getElementsByClassName("miavor")

    gss.play()

    if (this.id == 0) {


        if (sxm == 0) {
            cl++
            miavor3++
            miyavorner3++
            sxm = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (sxm == 1) {
            miavor3--
            miyavorner3--
            sxm = 0
            cl--
            this.style.backgroundColor = "black"


        }


    }
    else if (this.id == 1) {


        if (han == 0) {
            miavor3++
            miyavorner3++
            cl++
            han = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han == 1) {
            cl--
            miavor3--
            miyavorner3--
            han = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 2) {



        if (han1 == 0) {
            cl++
            miavor3++
            miyavorner3++
            han1 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han1 == 1) {
            cl--
            miavor3--
            miyavorner3--
            han1 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 3) {



        if (han2 == 0) {
            cl++
            miavor3++
            miyavorner3++
            han2 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han2 == 1) {
            cl--
            miavor3--
            miyavorner3--
            han2 = 0
            this.style.backgroundColor = "black"


        }

    }
    else if (this.id == 4) {



        if (han3 == 0) {
            cl++
            miavor3++
            miyavorner3++
            han3 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han3 == 1) {
            cl--
            miavor3--
            miyavorner3--
            han3 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 5) {



        if (han4 == 0) {
            cl++
            miavor3++
            miyavorner3++
            han4 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han4 == 1) {
            cl--
            miavor3--
            miyavorner3--
            han4 = 0
            this.style.backgroundColor = "black"


        }

    }
    else if (this.id == 6) {

        if (han5 == 0) {
            cl++
            miavor++
            miyavorner++
            han5 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han5 == 1) {
            cl--
            miavor--
            miyavorner--
            han5 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 7) {

        if (han6 == 0) {
            cl++
            miavor++
            miyavorner++
            han6 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han6 == 1) {
            cl--
            miavor--
            miyavorner--
            han6 = 0
            this.style.backgroundColor = "black"


        }

    }



    miav[0].innerHTML = "միավոր:" + miyavorner3
    if (cl == qanak) {
        post.play()
        //  var bar =document.getElementsByClassName("bar")
        var bara = document.getElementsByClassName("barer")
        for (let c = 0; c < bara.length; c++) {
            xax[0].removeChild(bara[0])


        }
        //var gams = document.getElementsByClassName("gamer1")
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        //xax[0].removeChild(gams[0])




        if (rejim == "Օբեկտի խաղ") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barer)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin2)


            }
        }

        else if (rejim == "Սովորական") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barers)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin2)


            }
        }

        else if (rejim == "Խառը") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(xar)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin2)


            }
        }


        else if (rejim == im) {

            for (let l = 0; l < qanak; l++) {
    
                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(sepakan)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin2)
    
    
            }
        }



        // var gamer1 = document.createElement("p")
        // xax[0].append(gamer1)
        // gamer1.setAttribute("class", "gamer1")
        // gamer1.setAttribute("align", "center")

        // gamer1.innerHTML = tim1

        sxm = 0
        han = 0
        han1 = 0
        han2 = 0
        han3 = 0
        han4 = 0
        han5 = 0
        han6 =0
        cl = 0
    }





}
function xaxayin3() {
    var miav = document.getElementsByClassName("miavor")
    gss.play()

    if (this.id == 0) {


        if (sxm == 0) {
            cl++
            miavor4++
            miyavorner4++
            sxm = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (sxm == 1) {
            miavor4--
            miyavorner4--
            sxm = 0
            cl--
            this.style.backgroundColor = "black"


        }


    }
    else if (this.id == 1) {


        if (han == 0) {
            miavor4++
            miyavorner4++
            cl++
            han = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han == 1) {
            cl--
            miavor4--
            miyavorner4--
            han = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 2) {



        if (han1 == 0) {
            cl++
            miavor4++
            miyavorner4++
            han1 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han1 == 1) {
            cl--
            miavor4--
            miyavorner4--
            han1 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 3) {



        if (han2 == 0) {
            cl++
            miavor4++
            miyavorner4++
            han2 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han2 == 1) {
            cl--
            miavor4--
            miyavorner4--
            han2 = 0
            this.style.backgroundColor = "black"


        }

    }
    else if (this.id == 4) {



        if (han3 == 0) {
            cl++
            miavor4++
            miyavorner4++
            han3 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han3 == 1) {
            cl--
            miavor4--
            miyavorner4--
            han3 = 0
            this.style.backgroundColor = "black"


        }

    }
    else if (this.id == 5) {



        if (han4 == 0) {
            cl++
            miavor4++
            miyavorner4++
            han4 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han4 == 1) {
            cl--
            miavor4--
            miyavorner4--
            han4 = 0
            this.style.backgroundColor = "black"


        }

    }
    else if (this.id == 6) {

        if (han5 == 0) {
            cl++
            miavor++
            miyavorner++
            han5 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han5 == 1) {
            cl--
            miavor--
            miyavorner--
            han5 = 0
            this.style.backgroundColor = "black"


        }

    }

    else if (this.id == 7) {

        if (han6 == 0) {
            cl++
            miavor++
            miyavorner++
            han6 = 1
            this.style.backgroundColor = "chocolate"

        }
        else if (han6 == 1) {
            cl--
            miavor--
            miyavorner--
            han6 = 0
            this.style.backgroundColor = "black"


        }

    }


    miav[0].innerHTML = "միավոր:" + miyavorner4
    if (cl == qanak) {
        post.play()
        //  var bar =document.getElementsByClassName("bar")
        var bara = document.getElementsByClassName("barer")
        for (let c = 0; c < bara.length; c++) {
            xax[0].removeChild(bara[0])


        }
        //var gams = document.getElementsByClassName("gamer1")
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        xax[0].removeChild(bara[0])
        //xax[0].removeChild(gams[0])




        if (rejim == "Օբեկտի խաղ") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barer)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin3)


            }
        }

        else if (rejim == "Սովորական") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(barers)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin3)


            }
        }
        else if (rejim == "Խառը") {

            for (let l = 0; l < qanak; l++) {

                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(xar)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin3)


            }
        }
        else if (rejim == im) {

            for (let l = 0; l < qanak; l++) {
    
                var bardiv = document.createElement("div")
                xax[0].append(bardiv)
                bardiv.setAttribute("class", "barer")
                bardiv.setAttribute("id", l)
                var barbar = document.createElement("p")
                bardiv.append(barbar)
                barbar.innerHTML = random(sepakan)
                // barbar.setAttribute("class","barer")
                barbar.setAttribute("align", "center")
                barbar.setAttribute("class", "bar")
                bardiv.addEventListener("click", xaxayin3)
    
    
            }
        }


        // var gamer1 = document.createElement("p")
        // xax[0].append(gamer1)
        // gamer1.setAttribute("class", "gamer1")
        // gamer1.setAttribute("align", "center")

        // gamer1.innerHTML = tim1

        sxm = 0
        han = 0
        han1 = 0
        han2 = 0
        han3 = 0
        han4 = 0
        han5 = 0
        han6 = 0
        cl = 0
    }





}








function game2() {
    var divs = document.getElementsByClassName("div")
    var kn = document.getElementsByClassName("gnacdiv")
    k.play()
     if (kn[0]) {
        xax[0].removeChild(kn[0])


     }
     if (divs[0]) {
                xax[0].removeChild(divs[0])
        
        
             }

    sxm = 0
    han = 0
    han1 = 0
    han2 = 0
    han3 = 0
    han4 = 0
    cl = 0

    var time = parseInt(jamanak)
    var cond = 0;
    var h1 = document.getElementsByClassName("h1")
    h1[0].style.marginBottom = "50px"


    var gamer1 = document.createElement("p")
    xax[0].append(gamer1)
    gamer1.setAttribute("class", "gamer1")
    gamer1.setAttribute("align", "center")

    gamer1.innerHTML = tim3



    var miav = document.createElement("p")
    xax[0].append(miav)
    miav.innerHTML = "միավոր:0"
    miav.setAttribute("class", "miavor")
    var timer = document.createElement("p")
    xax[0].append(timer)
    timer.setAttribute("class", "jamanak")


    // function varkyan(s) {
    //     // var min = Math.floor(s/60)
    //     var sec = s % 60
    //     return sec
    // }

    function setup() {
        //     var timer = document.getElementById("timer")
        timer.innerHTML = "ժամանակը:" + (time - cond)
        audioLA.play()
        function tameid() {
            cond++
            timer.innerHTML = "ժամանակը:" + (time - cond)
            audioLA.play()

            if (cond == time) {
                cond = 0
                bud.play()
                clearInterval(int)
                setTimeout(() => {
                    myus()
                }, 1400);



            }
        }
        var int = setInterval(tameid, 1000)
    }
    setup()

    if (rejim == "Օբեկտի խաղ") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barer)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin2)


        }
    }

    else if (rejim == "Սովորական") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(barers)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin2)


        }
    }
    else if (rejim == "Խառը") {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(xar)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin2)


        }
    }    else if (rejim == im) {

        for (let l = 0; l < qanak; l++) {

            var bardiv = document.createElement("div")
            xax[0].append(bardiv)
            bardiv.setAttribute("class", "barer")
            bardiv.setAttribute("id", l)
            var barbar = document.createElement("p")
            bardiv.append(barbar)
            barbar.innerHTML = random(sepakan)
            // barbar.setAttribute("class","barer")
            barbar.setAttribute("align", "center")
            barbar.setAttribute("class", "bar")
            bardiv.addEventListener("click", xaxayin2)


        }
    }
}




